[
    {
        "review_id": "rw1134033",
        "reviewer": "bensonmum2",
        "movie": "Halls of Montezuma (1951)",
        "rating": "7",
        "review_summary": "A \"Small\" War Movie",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "Despite it's grand name, Halls of Montezuma is a small war film. What I mean is that the movie focuses more on a small group of men and their fears and problems than it does on a grand plan for Allied victory. It's a very personal movie. We get to see these men up-close and we begin to develop feelings for them. I wouldn't doubt that this is one of the first films to show a U.S. Lieutenant so battle scarred that he resorts to using pain killers just to function. Unlike other war films of this era, not all of these men are going to make it to the end. War is like that. It doesn't pick and chose people to live because we like them. So in that regard, it's also more realistic than some other war movies made in the 50s.To succeed as a small, personal war movie as I've described, the cast has to be able to act. This cast does not disappoint. Richard Widmark, Jack Webb, and Karl Malden are all excellent in their respective roles. I was especially impressed with Webb who has an acting style that can grate on the nerves. He's more subdued here and it works. But as good as these three are, Jack Palance is the highlight of the movie for me. He was undoubtedly the most believable. I could really picture him doing the things in real life that were called for in the script.I have no difficulty recommending Halls of Montezuma to fans of war films. It's a very welcome addition to my DVD collection.",
        "helpful": [
            "21",
            "23"
        ]
    },
    {
        "review_id": "rw1134034",
        "reviewer": "hprice-jr",
        "movie": "War of the Worlds (2005)",
        "rating": "2",
        "review_summary": "E.T. Stay Home!",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "Steven Spielberg's third 'from out of this world' opus is just one big mess. It's difficult to understand how the man who gave us the charm of E.T. and the humanity of Close Encounters could deliver such pathetic junk. The biggest problem in this film is a script so lacking in coherency that it's writing seems better suited to one of those bad 50's B sci-fi movies. (I think I just heard H. G. Wells roll around in his grave for the umpteenth time.)The other big problem is the lack of empathy one feels for the characters. Cruise's daughter is so annoying I almost wished one of the tripods would put that screeching presence out of her misery. And what's with Tim Robbins? His hammy performance was the only true bit of humor to be found anywhere.Granted, the special effects are great and one should not expect any big statement on the human condition from big budget sci-fi, but we're talking Spielberg here. One anticipates not only a good show but a superior narrative from a good storyteller. On the positive side, the director goes for a much grittier look (a la Saving Private Ryan) which is appropriate for the subject matter. However, maybe the movie would have worked better had it expanded the story to involve more characters and encompassed more the broader effect of the invasion outside of Cruise's family.All in all, a total waste of talent and an even clunkier mess than the marauding invading aliens.",
        "helpful": [
            "17",
            "31"
        ]
    },
    {
        "review_id": "rw1134035",
        "reviewer": "cshep",
        "movie": "Christine (1983)",
        "rating": "7",
        "review_summary": "Bullied Student Gets REVENGE !!!",
        "review_date": "24 July 2005",
        "spoiler_tag": 1,
        "review_detail": "Joh Carpenter directs this early 80's Stephen King book, of a harried student, who vents Revenge, with a spooky car with a life of its' own.Have you ever been the victim of a school Bully or Bullies ? Did your parents repress your growth cycle, then this movie is for you .High School student Arnie Cunningham(Keith Gordon) has problems , lots of problems ! His parents won't let him grow up, Bullies pick on him at will, and no one REALLY understands him, so what is a young boy to do?, buy a haunted car , restore it and get REVENGE, a perfect formula and vehicle, forgive the pun, for which to give John Carpenter, license ,SORRY,..... to work with .Keith Gordon gives a good performance as the misunderstood teen.Director John delivers a decent effort of a Stephen King novel, with John Stockwell as Dennis Guilder and Alexandra Paul as Leigh Cabot, the misunderstood girlfriend of Arnie. Both actors give good performances, as the good side of the track students, who try to give Arnie the support he needs, to overcome the teenage obstacles that have embraced him.Well, that only goes so far, so Arnie finds solace in Christine , a 1958 Plymouth Fury, which plays 1950's music to display its' feelings of the moment...interesting.As the plot goes , the Bullies get more abrasive and attack Christine at will,at the shop where Arnie restored Christine to its' glory days..Arnie and Christine develop a \"Special \" relationship, and they almost become one in thought !So the haunted car goes on the Attack , getting Arnie the Revenge he was seeking. Sort of interesting, could have used a better music score. His friends see Arnie becoming more distant and try to bring him back to reality. Anyway, if you are looking for a ghostly movie with teenagers of angst, then this movie is for you .This movie rates 7 of 10 , see with a double feature with \"Fright Night\" . more teenagers , more angst, a lot of fun !!!",
        "helpful": [
            "1",
            "1"
        ]
    },
    {
        "review_id": "rw1134036",
        "reviewer": "mdehart_85",
        "movie": "Orientation: A Scientology Information Film (1996)",
        "rating": "1",
        "review_summary": "Seeing this movie was the single most hilarious experience of my life",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "The previous comment sums this movie up perfectly. A friend and I took a visit to the church of Scientology and saw the film for the fun of it. When the guy came back in to talk to us after the film was over I almost burst out laughing. We somehow managed to keep it inside, but when we walked out the door and around the corner I laughed the hardest I have ever for five minutes straight. Thanks Scientology!!!I would definitely recommend seeing this film for the sheer hilarity of it. But I wouldn't go telling them my name or address (it's fun to be someone else for an hour anyway). And if you do end up going be sure to bring up psychology and psychiatry they really against it and it's hilarious to hear the reasoning behind it.",
        "helpful": [
            "32",
            "40"
        ]
    },
    {
        "review_id": "rw1134037",
        "reviewer": "ppamjo2",
        "movie": "The Magic of David Copperfield XIV: Flying - Live the Dream (1992 TV Special)",
        "rating": "9",
        "review_summary": "These need to be on DVD",
        "review_date": "24 July 2005",
        "spoiler_tag": 1,
        "review_detail": "I saw this one a long time ago and just loved it. I remember when he came down in an elevator, and the next minute he seemed to be having a conversation with Orson Wells. I would love to see this entire show out on DVD so that I can go back and refresh my memory on some of the show. The magic \"trick\" that stole the show was the one where he was flying... I still have that segment on an old cassette and it still moves me to tears.I hope that David will consider bringing out his specials in a series type of release so that his fans can enjoy them intact and commercial free.. If you ever find this one on tape you will be thrilled and amazed by this man... A must see...I have watched this show a lot on my old tape and David is clearly the master of magic...",
        "helpful": [
            "5",
            "5"
        ]
    },
    {
        "review_id": "rw1134038",
        "reviewer": "stanford9",
        "movie": "10.5 (2004)",
        "rating": "1",
        "review_summary": "This movie is so bad in so many ways, I can't count them all.",
        "review_date": "24 July 2005",
        "spoiler_tag": 1,
        "review_detail": "I don't know why I struggled through this movie. Last year, when it premiered, the first fifteen minutes lost me when they depicted a quake in my city of Seattle doing the most unbelievable damage.The main example is how they showed the Space Needle. The Needle is made to pivot back and forth on its base, which goes 30 feet into the ground. It's built similar to a child's blow-up punching bag, with sand on the bottom. This film showed it motionless, then suddenly cracks go up the side and it collapses.That's just the beginning of such horrid scientific inaccuracies, that the scientists I read after this movie came out were right: this is not even science fiction, it's science fantasy.I'm sure seismologists WISH we could just watch a monitor that shows the magnitude on the Richter scale WHILE IT'S HAPPENING! That's the second thing that drove me away from this originally.The acting itself was acceptable, I'll admit that. I'm not an acting coach or director, so I don't know what to look for, but it seemed good enough.The storyline itself was ludicrous as well, again in too many ways to list completely.It's so bad. If you know anything at all about geology and quakes, I'd recommend you stay well away from this film.",
        "helpful": [
            "1",
            "3"
        ]
    },
    {
        "review_id": "rw1134039",
        "reviewer": "tamstrat",
        "movie": "Sideways (2004)",
        "rating": "10",
        "review_summary": "Absolutely Fabulous",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "I had heard about this movie from friends and finally got around to watching it. What a great film!!!! Rarely anymore do films and the actors excite me as much as this film did.The story of 2 middle aged men, both in the throes of a middle life crisis, heading up to Northern California wine country is an absolute hoot. The writing, acting and directing are top notch. Paul Giammetti is excellent as the wine snob, self loathing Miles. Thomas Haden Church is a hoot as Jack, the groom to be who is determined to sleep his way through wine country on the eve of his impending nuptials. Miles quiet desperation is so dead on, I am amazed that the Academy didn't even nominate him for Best Actor.This movie is a delight from start to finish.",
        "helpful": [
            "0",
            "3"
        ]
    },
    {
        "review_id": "rw1134040",
        "reviewer": "bintibop",
        "movie": "Good Times (1974–1979)",
        "rating": null,
        "review_summary": "a little perspective",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "This was a sitcom written primarily by white men during the tail end of a decade of civil rights intensity. It was actually the first attempt to present a more realistic view -- albeit by white men -- of the \"human element\" in what had been built up to outlandishly perverted stereotypes about Black people, and the projects. There were definitely stereotypes and caricatures in this series as there were in all sitcoms that had any aspirations of getting past their pilot episode.The cons were actually pretty minimal given the fact that no matter what was presented to the white public there was always going to be a twisting of what the actors and writers were attempting to convey, mostly because of a combination of ignorance and bigotry. It was a no-win situation, and personally I couldn't possibly have cared less what white people got out of the show. If I'm not mistaken, there was a much much larger white following of The Cosby Show than there was for Good Times. And we'll just attribute that to the \"comfort factor.\" The reality is that a whole lot of folks all across the country living in ghettos and projects are hard-working, law-abiding, church/mosque-going people who are committed to family. And yeah there's also crime. Anywhere you pile people on top of each other in crappy situations you're going to see crime.JJ was a caricature but he was also a very talented artist.James Sr. was a loving husband and father and a strong, intense, proud Black man. The fact that he threatened (but never followed through) is part of a language difference; too bad some folks couldn't see the overall makeup of this character as a loving, supportive father and husband. He was also a dark-skinned, African-featured actor in a positive role, and I'm frankly impressed they didn't cast someone with more \"palatable\" features for the white audience (you know, Harry Belafonte or goofy non-threatening faces like Bill Cosby).Florida was a full-figured, dark-skinned, African-featured woman who was depicted as an intelligent, strong, attractive, complex, and desirable WOMAN, which was most definitely a first in what had been and would continue to be the old plantation standard of beauty and the narrow role assignments generally given to women of Esther Rolle's stature.I'm still laughing about the comment that Thelma dressed like a slut! Hah! She dressed like a frickin' school teacher for ...well, any decade from the 60's to now.Many of the political commentary that was slipped in was done around Michael's dialogue with other characters, and usually it was done well.Bookman was a casualty of bad writing and a sloppy solution to a consistent antagonist. You could probably blame Jay Leno if you wanted. He and David Letterman were writers for the show, if memory serves.All in all there were positive messages within the body of the series and the character-driven episodes, and they were able to universalize many aspects of daily life and the nuclear - and extended - family.Of course there was offensive stuff in it too. There's no possible way to get everything right, please everybody, or avoid insulting somebody along the way. That's a tribute to human diversity as far as I'm concerned.",
        "helpful": [
            "2",
            "6"
        ]
    },
    {
        "review_id": "rw1134041",
        "reviewer": "elcopy",
        "movie": "Charlie and the Chocolate Factory (2005)",
        "rating": "3",
        "review_summary": "Why bother?",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "Unnecessary, redundant, pointless. I don't know what's the deal with Hollywood, but remakes aren't cutting it. Burton already has the equally mediocre and equally pointless \"Planet of the Apes\" remake on his resume. This movie premieres in a summer where other 70s movies like \"The Bad News Bear\" \"The Amityville Horror\" and \"The Longest Yard\" are being brought back for no reason other than Hollywood seems to have run out of ideas.Doesn't mean \"Charlie\" is a total disaster. It has many things that are possibly better than \"Willie\". But, if you have seen both, you can imagine anyone asking this question: \"Why bother?\". Honestly, I was bored in the middle of the movie. I didn't leave the theater because I try to watch a complete film no matter what, but nothing could fix the feeling.I can tell Hollywood that I read, and there are plenty of good stories out there yet to be told. If they have the courage to go for the next original hit, instead of giving people the same old stuff because it is already proved successful, they'll see the audiences erode. I am one who has bowed not to see remakes anymore after the release of the (second!) remake of \"King Kong\".",
        "helpful": [
            "1",
            "4"
        ]
    },
    {
        "review_id": "rw1134042",
        "reviewer": "moviemanMA",
        "movie": "Nosferatu (1922)",
        "rating": "10",
        "review_summary": "The Origin of Horror",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "What is it that makes a great horror movie? There has to be a lot of spooks and thrills that make it scary of course. But it can't be cheesy with a thin plot. There has to be a good, believable story...at least a good story. It has to be something you can follow along with and enjoy. Throw all of this together and you have yourself a horror movie. Today's horror movies focus on special effects and sometimes gory images that sometimes make you laugh. All of these films try to duplicate what the original horror film did. Flat out creep you out. Nosferatu did just that.Nosferatu is the essential horror movie. Filmed in 1922, it was a silent picture starring Max Schrek as Count Orlok, the vampire based on Dracula from Bram Stoker's classic novel about a vampire who moves from his castle to the city after a visit by Jonathon Hutter. This unauthorized version of Stoker's classic features Schrek as the thin, creepy, blood-sucking vampire. The story unfolds as Harker tries to settle the deal with the Count so he can move into his new home...right near Hutter. Little does he know that the Count is a vampire. After a close encounter after dinner with Orlok, Hutter is convinced that this guy is out for blood...literally. Now Orlok is moving into Hutter's town of Bremen, bringing in with him the plague. Hutter and his wife are dragged into this ordeal with Orlok. Along with the rest of the town, Orlok and the plague turn the town upside down.What makes this film so impressive is the result of Orlok's terrifying secret. Since Hutter doesn't know that he is a vampire, his expression of sheer horror when he finds out makes the movie kind of realistic. Although the thought of a person who drinks blood is preposterous, it's still scary as hell! Just the appearance of Count Orlok is frightening. There is a scene when Hutter realizes what the Count is and he opens the door to see him just standing there. The camera zooms in and he's just standing there. His hands at his side, nightcap off exposing his bald head and pointy ears. The sharp, narrow fangs hang down as if ready to bite your neck. Dracula is a familiar tale told for many years, but this portrayal is very scary, the silence is even scary.Although Bela Lugosi is known for the role of Count Dracula nine years after the release of Nosferatu, it was this movie that really got the Dracula fascination started. Nosferatu will continue to inspire and creep out all who watch it.",
        "helpful": [
            "2",
            "5"
        ]
    },
    {
        "review_id": "rw1134043",
        "reviewer": "cstrother-1",
        "movie": "Sideways (2004)",
        "rating": "10",
        "review_summary": "Best of 2004",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "I have seen all the big movies of 2004 now and I am convinced this one is the best, and an all-time excellent piece off work. I have also read the novel, seen the DVD, and listened to the voice-over by Giamatti and Clark.The music, the camera-work, the scenery, the wardrobe, the color, the lighting, the editing, the writing (particularly the adaptation of the novel), and lots of little touches all contribute to the mood and meaning. They say that comedy is harder than drama. How about a combination of comedy and drama that really works? How about such a combination, where the lead characters are not very attractive? Giamatti is excellent, but so is Clark. Lots of acting with little glances and subtle body movements. Madsen is perfectly cast and her character well-played. Many find that the interaction between Miles and Maya is not credible. It seems to me that Maya and Miles are both more than deep enough for this to resemble real life more than the movies.This may not be the most profound movie ever made, and it may not advance movie-making on a technical or technique level, but this is a very good film, all around.",
        "helpful": [
            "0",
            "4"
        ]
    },
    {
        "review_id": "rw1134044",
        "reviewer": "lee_eisenberg",
        "movie": "The Ladykillers (1955)",
        "rating": "10",
        "review_summary": "Inspector Clouseau and Commissioner Dreyfus, before Dreyfus wanted to kill Clouseau.",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "A long, long time ago (actually, only half a century ago) in a galaxy far, far away (okay, it was in this galaxy, on this planet), Obi Wan Kenobi was known as Alec Guinness, and he made some great movies, including \"The Ladykillers\". Guinness and some other men, among them Peter Sellers and Herbert Lom, are plotting an elaborate heist. But, their kindly old landlady Louisa Wilberforce (Katie Johnson) finds out about their shenanigans. She promises not to turn them in, but they decide to take her out anyway. Unfortunately for them, murder isn't as easy as it looks.They really created one neat movie here, the sort of flick that you just gotta love. And the remake was also quite good (unusual for American remakes of foreign movies) with Tom Hanks as the over-cultured heist planner.",
        "helpful": [
            "0",
            "3"
        ]
    },
    {
        "review_id": "rw1134045",
        "reviewer": "johnnycourageous",
        "movie": "Casuistry: The Art of Killing a Cat (2004)",
        "rating": "7",
        "review_summary": "I cannot see what all the fuss is about...",
        "review_date": "24 July 2005",
        "spoiler_tag": 1,
        "review_detail": "Controversy seems to have greeted this documentary everywhere it has screened, and its selection for the Melbourne International Film Festival was no exception. I had to run the gauntlet of a bunch of bleating, ill-informed animal activists who were making false claims that the organisers of the film festival were supporting a 'cat snuff film'. Nothing could be further from the truth. This is NOT a 'cat snuff film' - such claims would be laughable if they were not completely ridiculous and untrue.I find such premature condemnation irritating in the extreme. It is as clear as there is a nose of your face that the people so strongly opposed to this documentary have not a single clue as to what it actually contains. It does NOT contain the graphic components of the cat killing film in question. It does feature, however, a detailed and confronting written description of the film's content, by way of a written scroll giving a minute-by-minute description of its content. The audience is thankfully spared the real footage of the crime.Casuistry: The Art of Killing a Cat is a documentary, pure and simple - and I found it a very well balanced and objective one for that matter. It was very thought provoking. It features interviews with the cat killing criminals, as well as animal activists and an investigating policeman, among many others. It also highlights the killer's defence that it was some sort of 'work of art', especially given that one of them had previously made other films depicting animal cruelty in the name of 'art'.There is some footage of one of the killer's earlier film 'art' works, including dancing with the corpse of a pig obtained from an abattoir, and a peculiar music video featuring dancing skinned animals from a research laboratory. Perhaps the most confronting was the short depiction of the beheading of a small live chicken. All of this imagery was presented in context, and was neither condoning the acts, nor suggestive of such inclusions as being some form of entertainment. It was featured in this documentary to balance out the killer's argument that the filming of the cat's torture was not a precedent setter, but one that had occurred within the context of his previous 'art works' - a nonsense argument in my opinion.As a viewer, I was left feeling a sense of scorn and pity upon the perpetrators of this act - one of whom seemed to frequent minimise the severity of it, with lines of argument such as: \"well, we were drugged out\" and \"we kill animals for meat, so what's the problem\". They seemed mainly well spoken and articulate individuals, but ones that seemed to lack a sense of morality, consequence, responsibility and a honed capacity for knowing when to draw the line with certain reasonable or acceptable behaviours. I think most reasonable adults would agree that the deliberate infliction of real pain on human or animal, regardless of intent, is a tad bit intolerable.Speaking of what is intolerable, the session I attended contained a hefty presence of police and security personnel, after the cinema received some veiled threats. If animal activists think that threatening innocent cinema-goers - who are merely exercising their right to see what they wish - somehow increases the validity of their arguments, then they are sorely misguided and utterly deluded.",
        "helpful": [
            "5",
            "12"
        ]
    },
    {
        "review_id": "rw1134046",
        "reviewer": "fgarza",
        "movie": "One of My Wives Is Missing (1976 TV Movie)",
        "rating": "10",
        "review_summary": "Excellent Mystery!",
        "review_date": "22 July 2005",
        "spoiler_tag": 0,
        "review_detail": "I saw this movie several years ago and I never forgot it. It will keep you on the edge of your seat. The actors are wonderful. As soon as you think you have it figured out, something will happen to prove you wrong. When it ends you'll want to watch it all over again. I have never seen a movie like it since. It is so smart and creative, I wish more movies were as imaginative. It's a favorite of mine. I'd love to buy the video or DVD, but it's nowhere to be found. I wish it would play on T.V. again, so I could tape it. If you get the chance to see it, don't miss it. Tape it if you can, they hardly ever show it. If you love unpredictable endings this is the movie for you! Engoy! I did.",
        "helpful": [
            "10",
            "10"
        ]
    },
    {
        "review_id": "rw1134047",
        "reviewer": "email3005",
        "movie": "Funny Ha Ha (2002)",
        "rating": "10",
        "review_summary": "A haunting original",
        "review_date": "22 July 2005",
        "spoiler_tag": 0,
        "review_detail": "The unabashedly teensy-budgeted Funny Ha Ha, written and directed by Andrew Bujalski, is actually more like Funny Strangeor even Funny Unsettling. You might be tempted to walk out in the first 20 minutes, which seem artless and aimless: not very fascinating people making not very fascinating small talk in drab settings. The by-default protagonist, Marnie (Kate Dollenmayer), is a listless 23-year-old between jobs and quietly smitten with an old friend, Alex (Christian Rudder), who has just broken up with his girlfriend. Does Alex like her? Other friends, among them Alex's sister, don't quite know. Alex, it seems, doesn't quite know. Marnie doesn't communicate her affections very forcefully. In fact, she does nothing very forcefully. She drinks a little at parties, she lies around, she hangs out with laid-back friends, and she floats.Floating, indecision, the indefinite: This is the gray arena of Funny Ha Ha. The surprise is how the movie comes together and gets under your skin before you even know why you should give a damn. What seems improvised and random turns out to be controlled, at times cunningly shaped, and the surface of nonsequiturs and random shrugs conceals fairly intense emotionsthe emotions of self-consciously cool, easy, inarticulate people afraid to pin anything down. The nonaction is set (in what appears to be Cambridge, Boston, and Somerville) in midsummer and has a midsummer formlessnessan extension of the kind of languor you feel in those hazy dog days before the sudden hardness and definition of fall.Dollenmayer becomes more and more fun to read. A young woman with long limbs and sleepy eyes on a big, open face, she's just the sort of beauty whose self-effacing vibe would make her less than magnetic to really handsome guys and madly irresistible to nerdswho think that maybe, just maybe, they'd have a shot. The one she attracts is played by the director, who makes himself look very unprepossessing, indeed. In fact, he's cringe-worthy. The character he plays, Mitchell, tries to make a virtue of his self-deprecation: Loathing himself is obviously all he has to think about. He's so unappealing that it really would be a sign of self-disrespect for Marnie to go to bed with him. Fortunately, he's too lame even to press his case. But she'd be no better off with adorable Alex, whose boneless diffidence seems increasingly selfish and calculated.Funny Ha Ha is a bit of a stunt. How can intelligent people, even slackers, be this vaporous? No one talks about life, the world, politics, music, moviesanything concrete. But out of this vaporousness, and within the narrow parameters he has set, Bujalski has made an indelible film...by David Edelstein, Slate.com",
        "helpful": [
            "19",
            "32"
        ]
    },
    {
        "review_id": "rw1134050",
        "reviewer": "damiengraham61",
        "movie": "Land of the Dead (2005)",
        "rating": "3",
        "review_summary": "very poor",
        "review_date": "23 July 2005",
        "spoiler_tag": 0,
        "review_detail": "i think George let himself down of this one i was looking forward to seeing land of the dead after loving the 3 original zombie flicks i think George should of taken more time and listen to the fans of the movies to see how they wanted this one to be its hardly zombie vs human its more human vs human i say bring on the remakes day of the dead is up next due for 2006 and if dawn of the dead is anything to go by this will be the movie that brings back zombie movies. I'm a huge zombie fan but nothing beats the classics and resident evil milla jovavich as an ass kicking bio weapon just does it for me if your gonna see land of the dead i suggest you don't get to to excited the let down will be too hard to bear",
        "helpful": [
            "0",
            "2"
        ]
    },
    {
        "review_id": "rw1134051",
        "reviewer": "PL1981",
        "movie": "A Friend's Betrayal (1996 TV Movie)",
        "rating": "9",
        "review_summary": "An intriguing, enjoyable and wonderfully made movie",
        "review_date": "23 July 2005",
        "spoiler_tag": 0,
        "review_detail": "\"A Friend's Betrayal\" is an insightful, thought-provoking and interesting movie on a topic that has not been extensively dealt with in the entertainment industry –with a few notable exceptions. It was much more balanced, non-judgmental and rational than it could have been and I thoroughly enjoyed it.The performances in the movie are good. Sharon Lawrence provides an excellent portrayal of the elder woman and gives her character a unique amount of personality, depth and insight which allows the viewer to feel empathy and perhaps in some cases some sympathy for her point of view and the emotions she is going through. She is also exceedingly beautiful and vivacious and that also gives a realistic dimension to this role. Brian Austin Green is also excellent in the role of Paul –he gives the character enough passion, sensitivity and realism to make you also relate and identify with the feelings and emotions that he is experiencing. The supporting cast is also excellent –with John Getz, Ashleigh Aston Moore and Katie Wright all portraying their characters exceptionally and with perfection. The only disappointing character in my opinion was the character of Paul's mother –somehow her character seemed a bit too flat and one-dimensional. Perhaps this was biased by the fact that I didn't like her character but I still think she could have been handled better The script and dialogue in this movie flow well and avoids the trap evident in a considerable number of telemovies of becoming too clichéd or unrealistic. The issues involved in the movie are discussed and treated in a professional way and the consequences of the actions of all the characters involved are evaluated thoughtfully. I actually sympathized with the teenager and Sharon Lawrence's character here –being attracted to older woman myself –but the movie was wonderful at allowing me to see the other side of the picture. That's what I enjoyed so much about this movie –it didn't seek to pass judgment or editorialize about the actions of the main characters. It just let the story unfold quite close to the way that it probably would have in real life.I was disappointed with the ending of this film –which I won't reveal-but, like an early reviewer here, I agree that many would see it as a logical conclusion. I'm actually going to give this 9/10 –I found this enjoyable, entertaining and intriguing to watch and it totally exceeded my expectations",
        "helpful": [
            "4",
            "5"
        ]
    },
    {
        "review_id": "rw1134052",
        "reviewer": "hwadleigh",
        "movie": "The Desert Song (1929)",
        "rating": "8",
        "review_summary": "From another age - a wonderful wallow",
        "review_date": "22 July 2005",
        "spoiler_tag": 0,
        "review_detail": "Today's idea of \"cool\" just did not apply in 1929. It's not at all like a modern movie. It has title screens and actors using overly broad gestures and overacting in a nearly comical manner. They also sing in an artificial stylized semi-operatic manner. It combines the style of a silent movie with a stage production of an operetta. It is obviously from another age, but it only takes a few minutes before you accept the strange style and simply relax and enjoy it. The available DVD was obviously made from a print that came from barely salvageable deteriorating celluloid. The video quality is terrible and the sound quality is merely bad. In spite of all these problems, the movie is worth watching over and over. The comic scenes are amusing. The bad editing and overdrawn acting is mildly amusing, too. The music is fabulous and you soon relax and begin to love wallowing in the corn. The plot? Think of it as \"Zorro goes to Morocco\" and it was probably at least some of the inspiration for Superman (hero with a secret identity who wears a red cape, etc.). The 1953 version is more easily available, but much of the music and plot was gutted to try to make it a bit more \"cool\" in 1950's terms. Unfortunately, the sacrifices removed much of what made the original production work musically and emotionally. I prefer the older version and just wish there was a better print available. If you have any interest in classic operetta, this is a \"do not miss\" film. If you have no feeling for such music, you would probably find this a complete waste of time (and earn my sympathy for your inability to appreciate it).",
        "helpful": [
            "14",
            "15"
        ]
    },
    {
        "review_id": "rw1134053",
        "reviewer": "e77eman",
        "movie": "Charlie and the Chocolate Factory (2005)",
        "rating": "2",
        "review_summary": "new 'wonka' movie is a real stinker",
        "review_date": "23 July 2005",
        "spoiler_tag": 1,
        "review_detail": "this has to be one of the worst movies i have seen this year (maybe ever). it seems that lately johnny depp has been exploring his feminine side (see 'pirates') but this is ridiculous! 'willy' could have easily passed for 'wilma'. it was a terrible 'take' on this character. the movie just wasn't funny. i didn't laugh once. i could hear the audience's fake chuckling during all of the 'gee, they meant this to be funny so i better laugh' parts. it was sad. the flashbacks to willy's upbringing were idiotic and added nothing to the story. it was what it was - filler. i could go on and on about this stinker but i won't due to time constraints. the saddest thing about this mess was the total disregard for the main idea in the book (and the first movie). that willy was in search of a child pure of heart to run his company. remember slugworth offering a reward for any 'gob stopper' that the children would give him (against willy's orders)? then charlie gives the gob stopper back to willy instead of slugworth, giving up untold riches - and proving he was honest and had the utmost integrity. it was the best part of the book and it still brings a tear to my eye. the new movie doesn't even touch upon this all-so-important life lesson. that honesty and integrity bring the biggest riches. but i will give credit where credit is due, and there was one thing i did like about the movie. the final credits - as this was the sign that i could finally leave the theater.",
        "helpful": [
            "31",
            "48"
        ]
    },
    {
        "review_id": "rw1134054",
        "reviewer": "gretchstearns",
        "movie": "Finding Home (2003)",
        "rating": "10",
        "review_summary": "what a fantastic movie",
        "review_date": "22 July 2005",
        "spoiler_tag": 0,
        "review_detail": "The film was amazing. I don't even know where to begin to describe what I saw. It captured so many emotions. It was beautifully done. It's great to see a Maine film. Those don't come out too often, not to mention well done Maine films. I would recommend this movie for everyone and anyone...it's worth seeing, even more than once. I actually plan on going to see it more than once. It is an inspiring movie that shows you can learn from your past and heal things with the power of love. I was never left confused and the ending fit it perfectly. I can definitely see this film going places. It absolutely deserves it. Congrats to Lawrence David Foldes and Victoria Paige Meyerink...a job well done.",
        "helpful": [
            "2",
            "8"
        ]
    },
    {
        "review_id": "rw1134055",
        "reviewer": "theowl63-1",
        "movie": "Benefit of the Doubt (1993)",
        "rating": "7",
        "review_summary": "A mediocre film with an excellent performance by Irving",
        "review_date": "22 July 2005",
        "spoiler_tag": 0,
        "review_detail": "I have to say that although the story itself was quite mediocre, casting Amy Irving as the daughter was a brilliant move. Irving was practically unrecognisable as the woman who - many years ago - identified her father as the murderer of her mother.Irving is relaxed, uninhibited & - again - almost unrecognisable in her role as Karen Braswell. Karen has straight, bleached blond hair & drives a pick-up. Her role blew me away when I first saw this film. After \"Carrie,\" \"The Fury,\" etc... I was so used to seeing Irving as curly-haired, cautious, & retrospective. Karen Braswell was brashy, kinda trashy, blond & sure of herself - a role that actors literally kill for.If you are a fan of acting, I highly recommend seeing this film JUST for Amy Irving's performance. She is AMAZING-!!!",
        "helpful": [
            "6",
            "8"
        ]
    },
    {
        "review_id": "rw1134056",
        "reviewer": "dennisjsatlanta",
        "movie": "Outer Space Jitters (1957)",
        "rating": "1",
        "review_summary": "another besser disaster",
        "review_date": "22 July 2005",
        "spoiler_tag": 0,
        "review_detail": "The stooges are launched into space, land on a distant planet and (after the usual stooge shennanigans, save the world from alien zombies (a young dan \"hoss\" blocker\") The only reason i give this movie a 1 is because that is as low as the ratings go. The stooges in space can be a funny idea, but to pull it off you need THREE stooges, not 2 and the very unfunny Joe Besser. Imagine what Curley could have done with what is politely a bad script. Heck, even shemp or Curley Joe DeRita could have probably salvaged at least a few chuckles. Instead we are subjected to the annoying whinning of Joe Besser. This is a stooge short ( along with just about any other Besser shorts) that even the most die hardstooge fan (and i definitely count myself in that category) could not recommend.",
        "helpful": [
            "5",
            "12"
        ]
    },
    {
        "review_id": "rw1134057",
        "reviewer": "jpudwill",
        "movie": "Hide and Creep (2004)",
        "rating": "4",
        "review_summary": "First time actors!!!",
        "review_date": "22 July 2005",
        "spoiler_tag": 0,
        "review_detail": "If you enjoy \"B\" movies with \"C\" attitude then this movie is for you. While the plot is OK, it is predictable. The writing loosely reminds me of Kevin Smith's style. I am by no means comparing Kevin Smith to these writers so don't get your hopes up. The special effects are limited. This movie was done on a budget and it shows. The DVD box compares this movie to Shaun of the Dead. I don't think so. There are some funny parts though. Despite all of this movie's shortcomings, I did like it. This movie compares to \"Children of the Dead\" for so many reasons. I don't regret renting this move. IF you enjoy low budget horror films, give this one a try. It is a lot better than a lot of films I have rented.",
        "helpful": [
            "10",
            "11"
        ]
    },
    {
        "review_id": "rw1134058",
        "reviewer": "mojo2004",
        "movie": "The Ski Trip (2004)",
        "rating": "5",
        "review_summary": "It was adorable",
        "review_date": "22 July 2005",
        "spoiler_tag": 1,
        "review_detail": "I also caught this movie on LOGO while channel surfing.Yes the movie was low budget but the guys had me from hello.Omar was a cutie,Tyson was FINE and Terry stole the show.I think the movie was too long and some thing they touched on didn't click.It's called \" Ski Trip\" ' ' ' ' ' ' ' 'but all they did was ride upstate to a very tiny 4 bedroom house that ended up having 10 people stay overnight,7 guys 3 women.I don't really know what I'm spoiling since the movie didn't stick with a storyline.Yeah,Corey was depressed he turned 30 with no progress in his career as a cartoonist hoping to get his title published and his so called boyfriend dumping him.I don't know what if any scenes were cut but this is Logo and they do edit-to-death any profanity,sex or nudity.Having said that this is a very tame movie with laughs and a few sad moments.The bit with 6 grown men and their luggage squeezing in a small rental car in the wintertime was dumb.Corey's lesbian best friend Nicky kept saying her date for the weekend was deaf,mute and couldn't read lips yet the girl responded twice by talking???Very attractive cast and they did fine with what they were given.The actor who played Corey also directed so he wore one too many hats.He should have directed and had someone else play Corey since he was the least interesting character!I'd like to know what gays or lesbians thought of the film.I'm straight and female but even I can't understand why LOGO edits it's films when its target audience would be looking to get GLTB entertainment with all the sex,profanity and kissing intact!",
        "helpful": [
            "2",
            "10"
        ]
    },
    {
        "review_id": "rw1134061",
        "reviewer": "paulbleier",
        "movie": "Before Sunset (2004)",
        "rating": "1",
        "review_summary": "Gawd Awful BORING Movie",
        "review_date": "23 July 2005",
        "spoiler_tag": 0,
        "review_detail": "I rented this because I thought I'd score some points in choosing a chick flick this time. The reviews were positive. My wife asked me why this was a \"chick flick.\" I said, \"I guess because there's no car chases and nobody dies in the first fifteen minutes.\" Forty-five minutes later there was still no car chases, but we'd died several times over of boredom. Two people walking through Paris and yak yak yak yak yak yak yak yak, blah blah blah blah blah blah blah blahing about big \"MEANINGFUL\" topics that they didn't believe and couldn't make me believe they believed. My wife was insulted. \"Is this what they think women like?\" So my she says, \"I'm going to take a shower; let me know if anything actually happens.\" Fifteen minutes later, nothing had. \"You missed the car chase,\" I lied when she returned. She gave me 'that look.'Why did they make this movie? Why did I waste $2.57 to rent it? Because, despite the fact that we wound up turning it off it seemed I had scored some points for trying... Now I bet you wish you could see the trailers for THAT action-packed thriller.",
        "helpful": [
            "9",
            "31"
        ]
    },
    {
        "review_id": "rw1134062",
        "reviewer": "Son_of_Mansfield",
        "movie": "Star Trek II: The Wrath of Khan (1982)",
        "rating": "8",
        "review_summary": "The Best Of The Star Trek Movies.",
        "review_date": "24 July 2005",
        "spoiler_tag": 1,
        "review_detail": "The cast of the original series join with \"Space Seed\" survivor Khan(Ricardo Montalban), Paul Winfield(The Terminator), Bibi Besch, and newcomer Kirstie Alley in the most well rounded of the Star Trek films. The battle scenes, supported by an exciting James Horner score, come alive through good visuals and top notch editing. Ricardo Montalban flexes his mighty pecks, quotes Moby Dick, and utters a certain old Klingon proverb. Nicholas Meyer, writer of Star Trek 2, 4, and 6, leaves behind the carcass of the first film and starts a trilogy arc that is the most human of the series. The themes of life from death and an old enemy reviving a tired hero mirrors the production of the film. The scene where Spock is shot onto the Genesis planet as Amazing Grace plays in the background gets me every time. This is the apex of the original series of movies and probably in the entire series.Khan: \"Kirk, I wonder if you are familiar with the old Klingon proverb that revenge is a dish best served cold. (leans forward) It is very cold, in space! (music swells)\"",
        "helpful": [
            "0",
            "0"
        ]
    },
    {
        "review_id": "rw1134063",
        "reviewer": "Nazi_Fighter_David",
        "movie": "Shoulder Arms (1918)",
        "rating": "9",
        "review_summary": "Chaplin in his biggest hit, and one of the biggest of all time",
        "review_date": "24 July 2005",
        "spoiler_tag": 1,
        "review_detail": "In reaction to the dullness of the films of actual combat in that time, the wartime public increasingly turned to humor as escape from monotony and anxiety Charlie Chaplin feared that his great \"Shoulder Arms\" would offend people, but it became his greatest hit In it, Charlie, by luck, courage, and devilish ingenuity wins the war singlehanded and brings a captive Kaiser in triumph to London The chief difference between this hilarious burlesque and some of the serious war dramas was that in Charlie's case it all turned out to be a dream",
        "helpful": [
            "18",
            "21"
        ]
    },
    {
        "review_id": "rw1134064",
        "reviewer": "dtburr",
        "movie": "Mask (1985)",
        "rating": "8",
        "review_summary": "A Real Classic",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "Casablanca. Gone With the Wind.Mask? Well, Peter Bogdonavich isn't exactly a no-name director. Give him a great screenplay and you might just be surprised. I am no big Cher fan, as applies to her acting, but in my opinion it was her best performance ever. Same with Eric Stoltz (Rocky). Stoltz has been doing his thing for 30 years and I have never seen one of his characters that wasn't believable. The guy is \"uber-talented\" and a true professional. This was tough role. He didn't act from *behind* the mask - he had to act *through* the mask. That requires acting at another level of complexity.Sam Elliot (Gar) was believable for me as Cher's (Florence's)love interest and a biker leader. Some may say that all that biker stuff was over the top. I found it convincing. Bikers can seize on a cause with the jaws of a pit bull and be relentless in their support. This was, to me, a really believable situation.The Diana character (Laura Dern) was very welcome and sweet, but I do have a hard time believing that she had not been exposed to some of the concepts that Rocky worked on with her (colors and shapes). She came across as too smart for this stuff to have been a new concept, especially after seeing her parents, who did not seem to be idiots. At the same time, the parents were TOTALLY unbelievable characters. Their daughter, who they obviously love, has a disability, but they are totally repulsed by Rocky and his. It rarely works this way in real life.I do have to sum up with this: If at the end of the movie you did not cry - with real, liquid tears that you could feel with your hand, then you need to call the police right now and turn yourself in as at least a potential (if not actual) serial killer. Just sit on the steps of the front porch and wait for them to get there. Unless you're a certified something-or-other, is simply NOT POSSIBLE to watch the whole movie, and see the ending scene where Cher comes into Rocky's room after finding out he wasn't at school, and not get swept up into that emotion.",
        "helpful": [
            "1",
            "3"
        ]
    },
    {
        "review_id": "rw1134065",
        "reviewer": "pocca",
        "movie": "Tillie's Punctured Romance (1914)",
        "rating": "7",
        "review_summary": "uneven but entertaining",
        "review_date": "24 July 2005",
        "spoiler_tag": 1,
        "review_detail": "A series of amusing scenarios that as a feature film don't quite gel: as others have commented here, seeing the same slapstick gags over and over again can get monotonous. Still, some of the set pieces are quite amusing, the one featuring Marie Dressler (who looks like a cross between Mrs. Potato Head and Fatty Arbuckle in drag here) getting tipsy on a sip of alcohol, the movie within a movie and the spoof of exhibition dancing being among the highlights. Although modern viewers may come to this film expecting it to be a Chaplin feature (who atypically plays a villain), it is in fact very much Marie Dressler's filmmost of the film's comedy comes from watching the sometimes aggravating but essentially innocent Tillie flailing about like a giant, goggle eyed baby as she tries to cope with her unscrupulous gigolo lover and life in the big city. The film also does a sly take on that hoary leftover Victorian cliché, the distant wealthy uncle who conveniently dies: here the uncle rather inconveniently comes back to life (\"not so darn dead after all\" as a title card dryly observes). The film also features Mabel Normand as Chaplins' moll girlfriend (her petite beauty makes her a good foil for Dressler), and the Keystone Cops.",
        "helpful": [
            "4",
            "5"
        ]
    },
    {
        "review_id": "rw1134066",
        "reviewer": "Zombafyed",
        "movie": "Charlie and the Chocolate Factory (2005)",
        "rating": "5",
        "review_summary": "For a different generation",
        "review_date": "24 July 2005",
        "spoiler_tag": 1,
        "review_detail": "I knew the reviews on this flick were going to be split 50/50 love/hate. So I'll try to stick one in the middle.For lovers of the original, do not go into this movie expecting the Wilder version. You WILL be disappointed. The similarities will make you expect the same warm feelings, but for some reason, you might leave the theater cold, and maybe angry.It was a colorful film, and there was some good acting, but the menacing, mysterious Wonka is definitely missing. Maybe it wasn't Depp's fault, but with the combination of makeup, script, and character development, we end up with what everyone else is calling a androgynous Jacko-Wonka. Depp doesn't have that semi-psychotic explosiveness that Wilder's Wonka had. Depp's character is more true to the book, but let's face it, Wilder's Wonka makes the audience fear and love him at the same time. With Depp, you have a non threatening wise cracking, high pitched Wonka. Adults will make the connection to Michael Jackson, but it is doubtful that the kiddies will. Highmore does an excellent job with Charlie, and isn't as annoying as the original Charlie. His family also has more interaction. As far as the kids: Augustus was improved, much funnier; Veruca,..well, honestly the original Veruca definitely seemed more like a spoiled little brat, so you were happier to see her go; Mike TV is annoying in both films, however, I kinda liked the original's Jay Leno-ish lisp. The implementation of video games for the new Mike will probably connect better with kids though; Violet was definitely improved, and her mom was just creepy, but thats good.The beloved familiar songs are gone, and while the lyrics of the new soundtrack might be clever and humorous, the accompanying music is too loud and cluttered to hear it. While I was watching, I noticed that most songs ended without a chuckle from the audience, and I attribute that to them being inaudible. The effects were well done, a nice surprise in this era of crap CGI laziness in Hollywood. The Oompas are all the same character, which honestly doesn't really bug me that much. The music is what let me down. I like the background on the Oompas, it added a little fresh air to the movie, and gave you something new, and not redone.You definitely get a little more knowledge of Wonka's background as well as Charlie's family, including a dad that was not present in the first flick. I thought the background story was good, however, it was not presented in a timely fashion. It's hard for this film to compete with the original, just on nostalgic value alone. The original is a bona fide classic, and even though technology has changed, it is not the most important factor. Especially in a movie that is supposed to tug at your heart strings, as well as dazzle your eyes.Children will love it, and maybe cherish it when they are older, as the older generations now cherish the '71 version. But us older folks might leave the theater disappointed, noticing Hollywood's greedy hands as they stick their hands in our pockets while trying to distract us with 'amazing' CGI. Don't get me wrong, like I said before, the CGI was good, and the sets were great, but there was something missing, something needed to draw you in and captivate your imagination. I went into this with a solid confidence that if anyone could or should redo the original, the Burton/Elfman/Depp crew were the ones to do it. I've been a huge fan of the trio since I can remember, and have had, and will continue to have faith in their creativity and vision. Corpse Bride looks awesome, and I'm sure Burton will redeem himself with that one.This is a delicate anomaly of a movie to review, so I'll end with this: Don't see it if you want to see a new, improved original. See it if you are taking your kids and family. The joy that they will get from it might stir up the joy you got from the original, just in case the new one doesn't tickle your fancy.",
        "helpful": [
            "0",
            "2"
        ]
    },
    {
        "review_id": "rw1134067",
        "reviewer": "Phil-531",
        "movie": "The Devil's Rejects (2005)",
        "rating": "3",
        "review_summary": "Sequel Lacks Originality and Charm of First Film",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "Having enjoyed House of 1000 Corpses more than any other horror movie I have ever seen I went to see Devil's Rejects with very high expectations from Zombie. I was very disappointed. The use of strong language, which was employed wonderfully in the first film, was over used and eventually completely superfluous to the film itself. And while the violence was as brutal as you would expect from Zombie it seems his imagination ran dry in this second film. You can only be shocked so many times by the sight of a fleshy human mask. Even the characters were not as involving or interesting as they had been in the first film. If it had not been for Sid Haig giving us the Captain Spaulding we came to love from the first movie, it would have been completely worthless. Portions of the film seem to drag on endlessly, especially the scene with the movie expert rattling on and on about the Marx Brothers. I left the theatre feeling almost cheated; the invincible and completely insane characters, which were charming in the first film, had become these motiveless violent foul-mouthed vigilantes that I was loath to watch for two hours. In summation, Rob Zombie took a wonderful cult horror movie and added to it an insidious sequel that is not worth the price of admission. Wait for the DVD, then find a coupon for a free rental is my suggestion.",
        "helpful": [
            "3",
            "8"
        ]
    },
    {
        "review_id": "rw1134068",
        "reviewer": "lee_eisenberg",
        "movie": "Harry and Tonto (1974)",
        "rating": "7",
        "review_summary": "I will forever remember Art Carney as Harry (I've never seen \"The Honeymooners\", and there's apparently no reason to see it).",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "Road movies always make for interesting stories, including \"Harry and Tonto\". In a role that won him Best Actor, Art Carney plays retired New Yorker Harry Coombes, who decides to go on a cross-country tour with his cat Tonto. Harry not only visits his son and daughter (Larry Hagman and Ellen Burstyn, respectively), but also manages to live life to its fullest, come what may.Among other things, this movie shows that regardless of what we may assume, old folks still have it even at their age. I guess that when I'm as old as Harry, I'll have to go on a cross-country tour. Who knows what there is out there.",
        "helpful": [
            "11",
            "18"
        ]
    },
    {
        "review_id": "rw1134069",
        "reviewer": "sabsalonson",
        "movie": "Meet the Fockers (2004)",
        "rating": "9",
        "review_summary": "Rarely consider seeing a movie twice, but this is one of the few.",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "Meet the Fokkers is an incredibly funny movie. Its extremely rare when I even consider returning to see any movie a second time, but definitely have considered going to see this movie again. I and most of the audience laughed almost constantly...its a must see movie...you'll have great fun w/ this one. Ben Stiller, Robert DeNiro and Dustin Hoffman are sensational. The female stars were OK. Stiller's embarrassment of his parent's quirks and desire to impress his future in-laws is really comical. Meanwhile, the overly conservative Jack Byrnes(DeNiro)scans the Fokkers for reasons to prove why they do not \"qualify\" to be married into his family. I've never been a real DeNiro fan, but loved him in this movie. This could be one of the best performances in Robert DeNiro's career. I'm normally disappointed and get quite irritated with profanity/vulgar language in films, but the strong performances and incredible humor really overshadowed the various instances of off-color language.For certain this movie is a 9 and maybe even a 10.",
        "helpful": [
            "0",
            "1"
        ]
    },
    {
        "review_id": "rw1134070",
        "reviewer": "edkof",
        "movie": "Coach Carter (2005)",
        "rating": "9",
        "review_summary": "Great, very inspiring, good camera work",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "What a very excellent movie this was. From the 1st minute the movie was catching. Samuel L. Jackson as coach carter is Jackson at his very best. There is a lot of morality in this movie but it doesn't get annoying. To the contrary! All the messages are not just applicable for those who live in areas like Richmond, but are applicable to all people for all sorts of goals in life. The sport moments are great to watch, the camera work is good, sometimes great and the story is intense and involving. What more can you except from a movie like this. That's why I rated it a very large 10.You like movies about how people grow above themselves? Watch this one! You like sport movies? Watch this one. You like Jackson? Watch this one!",
        "helpful": [
            "0",
            "0"
        ]
    },
    {
        "review_id": "rw1134071",
        "reviewer": "lemon_magic",
        "movie": "The Killer Shrews (1959)",
        "rating": "3",
        "review_summary": "Amusing period piece with glints of potential under all the rubbish",
        "review_date": "24 July 2005",
        "spoiler_tag": 1,
        "review_detail": "I've watched this film several times over the years; the first time because the Medveds awarded it a Golden Turkey as one of the 50 Worst Movies of All Time, and after that for the MST coverage, and for its own sake. And I have to say, in defense of 'Killer Shrews' that there is just a hint of something good in this amusing period piece.Let's get a few things out of the way, right up front: The special effects for the title monsters are completely laughable (hand puppets for the close up shots and dogs covered with bath mats for the master shots). And not only do two of the main players have nearly impenetrable accents, the whole film is miked so badly that you can barely catch two words out of every three. The film takes forever to get started, and the first 20 minutes of the film is so static and badly blocked that you want to leave the room yourself to break things up and add some variety. The photography is grainy, badly lit black-and-white, especially in the indoor scenes. Some of the acting is strictly from Amateur Hour (especially the blond beauty pageant winner who we are asked to believe is a research scientist), and the rest of the acting is at the mercy of the plot and the director. The denouement, where the surviving cast members tie together a bunch of barrels that just *happen* to be in their backyard, get under the barrels and essentially barge past the shrews to the beach front - is so silly and badly done that you can't help but chuckle (including some of the most badly staged 'fake walking' you will ever see in a movie). And yet, there is some fun to be had here. The screenplay works mightily to establish an airtight, claustrophobic, no-way-out scenario for the cast. Best's character is articulate and resourceful in a 50's monster movie kind of way. Ken Curtis pulls out all the stops to portray a completely unsympathetic alcoholic, coward, back-shooting Judas and full time punching bag for James Best. The character actor who plays the absent-minded assistant professor actually imbues the role with a certain pleasant humanity and decency in spite of the cardboard nature of the role. There IS a palpable tension, and even anxiety and dread, in some of the scenes that manages to last in spite of the tons of exposition that get piled into the first half of the movie. Three stars out of 10. I can't rate it any lower than that in spite of the relatively low quality because I actually ended up kind of liking it in spite of all its faults - unlike many denizens of the Bottom 100, it tries to be about something, and has a certain innocence and enthusiasm that leavens the silliness and cheapness of the proceedings.",
        "helpful": [
            "1",
            "3"
        ]
    },
    {
        "review_id": "rw1134072",
        "reviewer": "Planet-man77",
        "movie": "Army of Darkness (1992)",
        "rating": "9",
        "review_summary": "Bruce Campbell...need I say more?",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "If the title of this comment didn't make you want to see the movie, maybe these will: Zomibies, shotguns, chainsaws, exploding arrows, evil twins, and time travel. Is there anything about this movie that doesn't rock? If you've ever wondered \"Who is this Bruce Campbell guy?\", or \"Why isn't Bruce Campbell in every movie?\" this is the movie for you. In fact, it's the movie for you no matter what. If you haven't seen it, see it now. If you have seen it, see it again. This movie is so good that a scene in \"Lord of the Rings: The Two Towers\" was actually based on a scene from this movie(almost holding a candle near gunpowder). Be sure to watch the special edition DVD version because it has a few extra scenes inserted into the movie and an alternate ending to watch.",
        "helpful": [
            "1",
            "2"
        ]
    },
    {
        "review_id": "rw1134073",
        "reviewer": "jb-schnitzler",
        "movie": "Hard Boiled (1992)",
        "rating": "7",
        "review_summary": "Best action",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "I love Hard Boiled, the \"developing of the characters\" scenes (mostly Tony's) are very powerful and a great trait of John Woo's Hong Kong action movies. Those scenes are good, however, the action scenes are what give this a 10. John Woo is the master of gun-play. My favourite parts are Chow's classic \"stair slide\" and the hospital gun fight where Tequila and Tony face off with Mad Dog. When Mad Dog rides into the warehouse and dismounts his bike (and kills) is also stylish and noteworthy. Out of the three John Woo movies I have (A Better Tomorrow-excellent; Once A Thief-meh and Hard Boiled), I'd have to put ABT slightly ahead of this one because of the storyline and Mark's restaurant assassination is my all time favourite gun scene. This may change though, because I have ordered the \"The Killer/Bullet In The Head\" set and am waiting for it to arrive (it went out of stock 2 days after I ordered it, so I have to wait until they restock (fu ckers). However, for pure action, Hard Boiled is the king.",
        "helpful": [
            "0",
            "0"
        ]
    },
    {
        "review_id": "rw1134074",
        "reviewer": "lee_eisenberg",
        "movie": "Voyage of the Damned (1976)",
        "rating": "7",
        "review_summary": "a fateful trip aboard a ship",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "Usually, it seems like whenever a movie has a giant cast, then that's the movie's only strength. \"Voyage of the Damned\" did have more to it than simply its cast. Faye Dunaway, Oskar Werner, Orson Welles, Max Von Sydow, Jonathan Pryce, Malcolm McDowell, Lee Grant, James Mason, and a bunch of other big names star in this true story of a ship that left Nazi Germany bound for Cuba. The passengers were German Jews who believed that they were on their way to freedom in Cuba, but realized when they arrived that there was never any plan to set them free.Maybe the cast does overshadow the plot, but it's still worth seeing. The movie is out of print, so you might have trouble finding it. Portland's Movie Madness has a copy, in case you ever come to Portland.",
        "helpful": [
            "17",
            "19"
        ]
    },
    {
        "review_id": "rw1134075",
        "reviewer": "MarcelPetit25",
        "movie": "The Machinist (2004)",
        "rating": null,
        "review_summary": "Excellent",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "Good Movie - Worth watching - Mr.Bale pulls off an amazing performance - Writing was great - Bale with his weight loss added to the his and the movie's freakishness - glad to see it was not too predictable either - Mr Bale only gets better - I hope he does a lot of parts like this rather than try to get to mainstream - This is one the best movies of the year, no doubt about it - With more people watching and hearing about it - It will live on for quite a while - From the start to the end we are brought into a strange, strange world and what a ride we go on - I want to tell everyone to watch this movie - Enjoy this movie and enjoy Bale's performance - There is also the talented Jennfier Jason Leigh who I can't say anything bad about her - she is amazing in anything she does",
        "helpful": [
            "1",
            "1"
        ]
    },
    {
        "review_id": "rw1134076",
        "reviewer": "jedi_master-2",
        "movie": "Rollerball (2002)",
        "rating": "10",
        "review_summary": "Its a must see, good movie to rent on weekends",
        "review_date": "24 July 2005",
        "spoiler_tag": 1,
        "review_detail": "***Contains things that may be regarded as spoilers you are warned*** Its like hockey without the sticks. I mean I've seen this movie twice and i still enjoy watching it. I love all the action scenes, and the ending is one in a million. Its got stuff I've never seen before in movies. the chick of the movie is a well known actor Rebecca Romijn-Stamos, the actor who plays mystique in X-Men 1-2-3. Ll cool j is in it too and he plays his part extremely well. So don't get me wrong this movie is a great one, and would be a great selection to watch when u get that action movie craving. This movie is a must see, and is a great movie to rent as a weekend movie.",
        "helpful": [
            "2",
            "6"
        ]
    },
    {
        "review_id": "rw1134077",
        "reviewer": "smurf923",
        "movie": "Brothers in Arms (2005)",
        "rating": "3",
        "review_summary": "Great thought, poor execution",
        "review_date": "22 July 2005",
        "spoiler_tag": 0,
        "review_detail": "\"Brothers in Arms\" is the latest in the sub-genre of 'hip-hop westerns', which stills strikes me as a great idea, but has yet to be realized into something more worthy than direct to video fare (Wild Wild West included). This film doesn't change that. It does have passable performances from Gabriel Casseus and Raymond Cruz to off-set the outright horrible ones of Antwon Tanner and Kenya Moore. Better than average (at least for direct to video) cinematography is overshadowed by the stale production design, dismal writing, dead action sequences, and repetitive stock hip-hop music. Hip-hop could hack it in a western, just hear T-Bone Burnett's work with the Nappy Roots in \"The Ladykillers\" and imagine the possibilities. But here, it's a complete distraction. How Jean-Claude La Marre ever nabbed David Carradine for this, I can only guess, but he does as good a job as anyone could've done with the writing and, in this kind of wreck, professionalism is the most you could ask for.The last 5 minutes are so pretentious and melodramatic, they border on unwatchable. Please, save the song for the credits next time. If you want the scene to be powerful, give us a character that we have a reason to care about.Here's to the next effort in this sub-genre, may it be something deep and resonant... Ernest Dickerson, where are you when we need you!",
        "helpful": [
            "11",
            "14"
        ]
    },
    {
        "review_id": "rw1134079",
        "reviewer": "gparlett",
        "movie": "The Skeleton Key (2005)",
        "rating": "6",
        "review_summary": "Good but predictable",
        "review_date": "22 July 2005",
        "spoiler_tag": 0,
        "review_detail": "The Skeleton Key is one of those movies thats spooky rather than scary. It uses the rich backdrop of New Orleans voodoo to build this great atmosphere, and then doesn't really do anything with it. Good performances all around, especially from Kate Hudson, but the film suffers from a very predictable plot. There's a twist at the end of the movie, as there almost always is in these movies, but its telegraphed it so far in advance that you're bored by the time they actually reveal what happened. Much more 'The Village' then 'The Others' or 'The Sixth Sense'. As other reviewers noted the film does win points for having really good final five minutes.",
        "helpful": [
            "1",
            "4"
        ]
    },
    {
        "review_id": "rw1134080",
        "reviewer": "shara-4",
        "movie": "Stealth (2005)",
        "rating": "7",
        "review_summary": "Surprisingly enjoyable",
        "review_date": "22 July 2005",
        "spoiler_tag": 0,
        "review_detail": "I did not go into this movie with high expectations (my husband received free tickets to an advance screening). However, I was pleasantly surprised! I disagree with another reviewer - I thought the first 15 minutes were oddly paced and filmed poorly (the camera is shaking as we look in on the office of a politician initially).However, the film picks up from there with solid, well-developed characters, especially Jamie Foxx playing the role of a smart pilot who expresses the moral quandaries of his work at one point and Jessica Biel as a strong female pilot (both physically and psychologically). The audience enjoyed the movie as you could tell from their laughter at Jamie's quips.While the plot is a bit predictable, it truly is an enjoyable ride. Best of all, my husband is an aerospace engineer and he was impressed with the overall accuracy of the film \"for a Hollywood movie.\" I've had to listen to him (and his co-workers) complain about other movies, but they enjoyed it too - so we give it a thumbs up in you're in the mood for an exciting action movie - or love planes - with just a touch of romance (innuendo only, nothing graphic).",
        "helpful": [
            "111",
            "202"
        ]
    },
    {
        "review_id": "rw1134082",
        "reviewer": "rudd_girl",
        "movie": "The Magical World of Disney: Young Again (1986) Season 30, Episode 13",
        "rating": "10",
        "review_summary": "I LOVE Young Again!",
        "review_date": "23 July 2005",
        "spoiler_tag": 0,
        "review_detail": "One of the best TV movies ever made! Why Disney hasn't released it on US VHS and DVD is beyond me. I originally watched it on the Diney Channel when I was little just to see Robert Urich and came away with a major crush on Keanu Reeves! This movie has a lot of heart and soul. One of Reeves' best performances. Reeves and Wagner are sweet together and Robert Urich is at his best. The way in which the screenwriter and director went about Urich's character getting his wish was smart. This movie is not at all cheesy like a lot of TV movies. The only flaw in the film is that it is too short(85 min.), so you don't get much of Urich and Wagner together. However, Reeves'charisma saves the film and makes you want more of him than Urich. A great film for the whole family. A+",
        "helpful": [
            "4",
            "4"
        ]
    },
    {
        "review_id": "rw1134083",
        "reviewer": "databeast",
        "movie": "Crash (1996)",
        "rating": "7",
        "review_summary": "It. helps to read the books, but that's not necessarily a good thing..",
        "review_date": "23 July 2005",
        "spoiler_tag": 0,
        "review_detail": "Like many of Cronenberg's other movies with a literary basis, it's hard to watch, understand, or review the films he creates without having seen the original movies.In an era when filmmakers are often criticized for ignoring the source material when adapting works to the screen, Cronenberg tends to go the other way, creating movies that are unrewarding nonsensical for people not already familiar with the source material (one of my favorites, Naked lunch, would likely be on the bottom of my list if I weren't already a William S. Burroughs fanatic).Likewise with Crash, a movie that will have you saying 'what the hell was that all about?' for the rest of the day after watching it, unless you already dig the psychotic, proto-rivet-head literary musings of J.G. Ballard. Of course, if you do, then the film won't give you anything new, just provide eve candy to supplant a work you're already familiar with.If you're a fanboy of the dementedly surreal and Cronenberg's perversely postmodern take on social commentary, you'll probably end up with this in the film library; if not, you'll probably be demanding your rental fees back.In a nutshell: like much of Cronenberg's stuff - not guaranteed to make sense to anyone but Cronenberg himself, caveat emptor.",
        "helpful": [
            "1",
            "2"
        ]
    },
    {
        "review_id": "rw1134084",
        "reviewer": "rabartels",
        "movie": "Peter en de vliegende autobus (1976)",
        "rating": "8",
        "review_summary": "wonder movie",
        "review_date": "23 July 2005",
        "spoiler_tag": 0,
        "review_detail": "I have this movie on video.It's a nice kids movie. Peter who is in a wheelchair dreams about to be a pilot. His class is busy with making a musical, in which they people to fly.He comes around Qerinus Drijfhout, which is an inventor. He is inventing a device, which he can make things fly.Since the movie is from 1977, the special effects are outdated and it is clearly visible that it's fake. However, never-the-less, it's a wonderful movie to watch from our famous kids film director \"Karst van der Meulen\" and it gives some sentiments from my youth.",
        "helpful": [
            "1",
            "1"
        ]
    },
    {
        "review_id": "rw1134086",
        "reviewer": "eoster2020",
        "movie": "Lagan (1971)",
        "rating": "10",
        "review_summary": "great story, great music plus social and political commentary",
        "review_date": "23 July 2005",
        "spoiler_tag": 0,
        "review_detail": "I have never commented on a film on this website before but after seeing the horrible ratings people have given this film I was compelled to set the record straight. This is one of the greatest bollywood films every made. Granted an appreciation of bollywood is an acquired taste this film is one of the most accessible to western audiences. I am an western so i know from where i speak. The story is combination of politics, history, love and sports (cricket to be exact and you will even learn something about how cricket is played)The music and lyrics are poignant and beautiful. Yes bollywood movies are musicals. The songs in this one deal with British imperialism, love, nature, and life. Most of the dance numbers are staged outside. Some with big flourishes with the entire village dancing. Other times intimate songs and dances that capture the passion of two people in love. The traditional Indian dances are exhilarating and the singing will leave you breathless. Sometimes the songs do repeat themselves so just fast forward them a little. But all in all the musical numbers are captivating and exhilarating. The plot dealing with British imperialism will teach you a history lesson. Political intrigue and an interracial love are the glue that hold it together. You will see the clash between Indian culture and British rule. This film will give you a look into an exotic land that few of us will ever see. And for this alone you should see this film.Do not overlook seeing this movie. This is a musical that uses the power of song and dance to tell a timeless story of people overcoming adversity against tyranny and oppression.",
        "helpful": [
            "6",
            "9"
        ]
    },
    {
        "review_id": "rw1134087",
        "reviewer": "joweb57-1",
        "movie": "The Dark Past (1948)",
        "rating": "8",
        "review_summary": "Interesting film noir",
        "review_date": "23 July 2005",
        "spoiler_tag": 0,
        "review_detail": "Being a big Bill Holden fan since I was a young woman, I have seen this film many times. I think the psycololical breakdown of the lead character played by Holden was very well done with the usual laid back help from Lee J. Cobb as the psychiatrist being held captive. Cobb is intrigued by Holden's torment and tries to help him, even although he fights the help at first. The dream sequences shown when Holden relates them are well done for the time period of this film. It made a big impression on me when I was young. You have to see this film from a historical perspective, not by today's standards. It was made during a much simpler time.",
        "helpful": [
            "12",
            "15"
        ]
    },
    {
        "review_id": "rw1134088",
        "reviewer": "mr1orange3",
        "movie": "Mr. Vampire (1985)",
        "rating": "8",
        "review_summary": "A Kung-Fu-Zombie-Comedy!? Alright!",
        "review_date": "23 July 2005",
        "spoiler_tag": 0,
        "review_detail": "Personally, I think that everyone should see Mr. Vampire, if only so that they can claim to have seen a kung fu zombie comedy. But, in my opinion, this is almost more of a Chinese Ghostbusters with some kung fu sprinkled in than a kung fu movie, which was somewhat of a disappointment for me. The story is fun, fresh and full of more than just zombies (although I won't reveal any surprises). The action, when it occurs is fully justified, which is something I always like to see, and is choreographed quite well by Lam Ching-ying. The comedy is somewhat hit or miss, but it didn't bother me very much. I had a lot of fun but I came away wanting more action. If you feel the same way, try Encounters of a Spooky Kind, which has all the zombies you love, but with more kung fu.",
        "helpful": [
            "8",
            "8"
        ]
    },
    {
        "review_id": "rw1134089",
        "reviewer": "tarbosh22000",
        "movie": "Brothers in Arms (2005)",
        "rating": "6",
        "review_summary": "Better Than Expected.",
        "review_date": "22 July 2005",
        "spoiler_tag": 0,
        "review_detail": "\"Brothers In Arms\" is a decent urban western. The plot is about two brothers and his gang of thieves who plan to rob a bank. The only things that stand in their way are: The corrupt town governor Driscoll and his bounty hunters.The movie is fast-paced but the bank robbery scene\\aftermath is almost half the movie and because of that there is some repetition in the dialogue.The performances are okay. The standouts are Raymond Cruz as the Reverend and David Carradine as Driscoll. Ed Lauter and Kurupt stand around for most of the film. The gunfights could also use some improvement. When the ending comes it stops being an action movie and starts being a drama, which works actually.In the end: Besides some minor problems, \"Brothers In Arms\" is still worth watching.For more insanity, please visit: comeuppancereviews.com",
        "helpful": [
            "20",
            "38"
        ]
    },
    {
        "review_id": "rw1134090",
        "reviewer": "AlanJ2",
        "movie": "The Skeleton Key (2005)",
        "rating": "8",
        "review_summary": "Really good, also original",
        "review_date": "23 July 2005",
        "spoiler_tag": 0,
        "review_detail": "After a slightly slow start, 'Skeleton Key' develops into an original, evocative and at times genuinely scary occult thriller so Ehren Kruger has redeemed himself after his truly wretched script for 'Ring 2' . I am not going into spoilers, which would be extremely destructive for a film of this kind but there are very clever character shifts, achieving a wonderful tension lock for the last 40 minutes or so mainly because all the performances are so good. The use of props and flash-backs is also wonderfully rich. The setting is contemporary New Orleans and its surrounds but this is mythical south and none the worse for that. The mix of influences includes 'Turn of the Screw', 'Rosemary's Baby' 'Burn Witch Burn and a few other classics but that is to give nothing away for it absorbs them into something quite new. My only criticism would be there is something a little confined about the movie--especially at its start-- but its style and pace and excitement utilise this triumphantly by the end.",
        "helpful": [
            "49",
            "80"
        ]
    },
    {
        "review_id": "rw1134091",
        "reviewer": "deboerjo",
        "movie": "Stealth (2005)",
        "rating": "6",
        "review_summary": "Surprisingly good, but not exceptional",
        "review_date": "22 July 2005",
        "spoiler_tag": 0,
        "review_detail": "I went into the movie with very low expectations, and came out pleasantly surprised. There's more to the movie than the previews imply. The action is exciting, the characters are rather more developed than I expected, and the plot is sufficiently complex as to be interesting. But it still has flaws. Biggest among them, if you know anything at all about aircraft you'll have to completely turn off your mind's capacity for critical thought in order to enjoy the movie. It would take pages to list all the technical inaccuracies. The worst was probably the midair refueling blimp. Yes, that's right, blimp. Second was probably the vast area these small aircraft cover on 1 refueling; from a carrier in the eastern pacific, they to the India/Pakistan region, then into Russia, then to Siberia, then Alaska, and then back to the southeast Pacific, all in a matter of a few hours. That's to say nothing of the design of the aircraft themselves, which is ludicrous.",
        "helpful": [
            "3",
            "8"
        ]
    },
    {
        "review_id": "rw1134092",
        "reviewer": "sweetmik",
        "movie": "Four Brothers (2005)",
        "rating": "10",
        "review_summary": "Awesome movie, did expect it to be as good as it was.",
        "review_date": "22 July 2005",
        "spoiler_tag": 0,
        "review_detail": "Went to see a preview of it two nights ago, and was presently surprised with it. Very good movie. Despite the fact that it's about four brothers avenging their mothers death, there is a lot of humor in it. The brothers give each other sh*t all the time, but you can tell they love each other. Mark Whalberg (sp?) did a good job, but i think my favorite character was Jackie, played by Garrett Hedlund. There was a lot of action, a lot of violence, very graphic, but it was well done and believable. Not exactly a movie for children, but it's a family movie. All in all, it's very funny and uplifting (towards the end), but very sad.",
        "helpful": [
            "83",
            "163"
        ]
    },
    {
        "review_id": "rw1134095",
        "reviewer": "dominice",
        "movie": "Stealth (2005)",
        "rating": "8",
        "review_summary": "This is a great show",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "I have been motivated to give my comments by the only review that was available at the time.I agree about the special effects, but the show was great! Yes the story is some formula, but it did have a surprise or 2, and I liked the way it all came together. At 2 hours and change for a running time, I was never bored, and throughly entertained. It delivers what I expected, action all the way.I would recommend it to Beal fans, there is a scene by a waterfall that is amazing and contains no action at all, but does not have to. In addition, I kept thinking about the twist of events that we arrive at the end of the movie. I am still not sure if I like the ending or not, but I definitely keep thinking about it. That to me is a sign of a good movie, you keep turning it over in your mind.I am sure snotty critics will tear it apart. It ain't art, but, it is science. (Science fiction, and close to home at that.)",
        "helpful": [
            "25",
            "50"
        ]
    },
    {
        "review_id": "rw1134096",
        "reviewer": "sj_2150",
        "movie": "Fatal Pursuit (1995)",
        "rating": "1",
        "review_summary": "tsk tsk tsk... absolutely terrible",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "This has to be one of the worst movies of all time. The characters are completely unoriginal, acting is terrible and offers no belief in the story what so ever (also the actress doesn't keep her English accent for the whole movie, it seems to fade), the story is as bad as it gets and the scenes are just stupid. One of the first scenes it the movie shows people getting shot up. some guy somehow gets caught on fire and falls into death next to a parked limo. he is about a meter away and the limo explodes. this is the highpoint of the movie and it wasn't even good. I cannot believe that this was made in 1998. By the looks of this movie you would think it had to be a terrible movie from the early 80s.",
        "helpful": [
            "1",
            "2"
        ]
    },
    {
        "review_id": "rw1134097",
        "reviewer": "KandyKisss4u",
        "movie": "Melanie (1982)",
        "rating": "10",
        "review_summary": "A Heart Warming Movie",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "Melanie has got to be one of the most Heart Warming stories...Burton Cummings plays the main part and what a Great Job he has done..Burton is one of the most talented singers of all times...The older he gets the more talent comes from his Golden Voice...God Bless You Burton Cummings ....I have seen him in concert over the years and he will always be Number One...I do hope that some of you get to watch the Move Melanie....Or buy it from ebay...Don Johnson, Paul Sorvina and Glynnis O'Conner...This is a poignant and Heart Warming adventure of Love And Courage...This was Burton Cummings only movie that he made and did One Great job as an Actor",
        "helpful": [
            "4",
            "5"
        ]
    },
    {
        "review_id": "rw1134098",
        "reviewer": "say_no87",
        "movie": "Drake & Josh (2004–2007)",
        "rating": null,
        "review_summary": "Drake and Josh ROCK",
        "review_date": "23 July 2005",
        "spoiler_tag": 0,
        "review_detail": "I love Drake and Josh! They are the funniest on Nickelodeon!! I recommend watching this awesome show! :) I think this show is even funnier than The Amanda Show. True, Drake and Josh were both on the Amanda Show but on Drake and Josh they are much funnier! They really rock. I hope no body hates this show. I can't see why anyone could. It is truly an awesome show. I'm like obsessed with this show! I never miss an episode and I barely miss the re-runs! Its like addicting! And hilarious. I know some of the funniest shows on Nick are All That, Kennen and Kel, The Amanda Show, and Cousin Skeeter so if you absolutely love those shows, you will love Drake and Josh.So watch this awesome show!",
        "helpful": [
            "4",
            "8"
        ]
    },
    {
        "review_id": "rw1134099",
        "reviewer": "daillewe",
        "movie": "Lil' Pimp (2005 Video)",
        "rating": "10",
        "review_summary": "The Mother F**ker of all films",
        "review_date": "23 July 2005",
        "spoiler_tag": 0,
        "review_detail": "This is one of the few films that hits the nail on the head. They set about making a kid a pimp and they succeed, while having a laugh along the way. The choice of characters is superb, as well as being extremely well scripted. Bernie Mac was made for the part of Fruit Juice, and there was no better choice for Tony Gold than William Shatner.With a pretty much all star cast the only things that were lacking was length (113 mins isn't long enough), and the total lack of advertisement. I stumbled across this little gem in my local video shop and only rented it to see what the deal was with having a comedy legend such as Bernie Mac teamed up with Captain Kirk. The Results? a masterpiece!",
        "helpful": [
            "1",
            "2"
        ]
    },
    {
        "review_id": "rw1134100",
        "reviewer": "superj",
        "movie": "Having Wonderful Crime (1945)",
        "rating": "8",
        "review_summary": "Charming detective comedy...",
        "review_date": "23 July 2005",
        "spoiler_tag": 0,
        "review_detail": "I've seen this film twice and think that's it's a very charming and humorous detective flick. The way that Pat O'Brien and Carole Landis play off of each other is great. It really holds up considering that it was made in 1945. I really thoroughly enjoyed it on each viewing and will watch it again whenever it comes on. I agree with one of the other commentators... Landis is a hottie!! My only regret is that they didn't make any more with these characters. They could've done so much more! If you like the \"Thin Man\" movies with William Powell and Myrna Loy then you'll enjoy this one also! Take a chance... WATCH IT! :-)",
        "helpful": [
            "20",
            "25"
        ]
    },
    {
        "review_id": "rw1134101",
        "reviewer": "realblades",
        "movie": "Live Evolution (2001)",
        "rating": "10",
        "review_summary": "One of the greatest live videos ever",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "The Live Evolution project is a sort of cross-section of Queensrÿche history. It has been divided into four phases/eras/suites: EP/Warning/Rage, Empire/Promised Land, HITNF/Q2k and Mindcrime. The disc also contains interviews and some other extra material. The material appears to be recorded on two days at the same stage and comes across as a very coherent concert experience.The technical aspect is excellent and the playing is very controlled and manages to bring the wide array of music contained on the numerous records into one package very well, fusing old and new material together.Naturally DeGarmo was a huge part of Queensrÿche and will feel missing here. On the other hand, this recording really shows just how much Michael Wilton (and the rest) can do. The singing is commendable and quite faithful to the originals, containing no ugly visioning or surprises that so typically tend to end up on live records.It is clearly a live show but it manages to have sound and performance \"quality\" rivaling studio recordings. As such, the DVD and CD could even be considered a partial remake of the old material that doesn't suffer from lack of recording technology or experience and dated style etc that tends to haunt older studio records.Great work from a very professional and talented group of musicians and production crew.",
        "helpful": [
            "0",
            "0"
        ]
    },
    {
        "review_id": "rw1134102",
        "reviewer": "nampets",
        "movie": "Eddie Griffin: Voodoo Child (1997 TV Special)",
        "rating": "10",
        "review_summary": "Awesome!! Very funny. Still can't stop laughing.",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "This stand-up routine was incredible. I must have watched it 100 times by now and I laugh harder every time. I am a comedy guru and love to watch stand-up. I really do enjoy anything Eddie Griffen does and Ithink he is a comedic genius. He's the best. Everyone says Chris Rock is the new Eddy Murphy but I say they are wrong, it's Eddie Griffen. He needs to do more movies and release more stand-up. The closest to him is Dave Chapelle. He was cast in Undercover Brother with Eddie and that is a true masterpiece. Un fortunately Dave likes to focus his comedy on drugs and I find that only gets a cheap pop. Eddie only touches on the drug scene but most of his comedy is real life situations that everybody can relate to. He can make almost anything funny. Keep it up Eddie, your fans are with you.Definitely recommended. 10 stars. A+++++ You will laugh so hard you will wet yourself. I guarantee it.",
        "helpful": [
            "1",
            "1"
        ]
    },
    {
        "review_id": "rw1134103",
        "reviewer": "agripicante",
        "movie": "Factotum (2005)",
        "rating": "2",
        "review_summary": "painfully cartoonish and watered down version of bukowski",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "This movie does a poor treatment of portraying bukowski, completely missing out on his grittiness and dark humor. This movie might as well have been about any average joe with girl problems and job problems. Even worse than the script was Dillon's boring portrayal of Chinowski (Bukowski's alter ego). Seeing a dirty, decrepit, drunken man like bukowski in the lead role might have made this movie mildly interesting, but instead we have this overacting pretty boy horribly miscast. Additionally, the rest of the casting was equally atrocious-more watered down acting from the likes of Marissa Tomai, etc. If you want to see the real Bukowski on screen check out Barfly, which is not perfect, but much better, or better yet try to track down the old documentary video called ¨Bukowski drinks, smokes, and talks,¨ which has candid footage of bukowski boozing, chain smoking, driving around the sleaziest parts of LA and yelling at his girl friend. Once you've seen this, you'll realize what garbage Factotum really is. Perhaps this movie would be great if you know nothing about bukowski but love this Dillon guy (I pity you).",
        "helpful": [
            "28",
            "60"
        ]
    },
    {
        "review_id": "rw1134104",
        "reviewer": "mariemoren",
        "movie": "The Unknown (2005)",
        "rating": "10",
        "review_summary": "Go into the unknown with new eyes.",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "The Unknown is a new look at an old legend. Exploring the unknown will lead you into the super-natural. It's out there...are you ready ? You thought you knew everything about what's been told about Bigfoot. This film will take you to a new perspective. It will show you how people create their own future by acting upon information they assume to be true. The photography in this film is done in HD. Bringing to the viewer, images that are clearly and highly defined. Taking you into each scene, as if you were right there. Carefully directed, the story could be from your home town. You could have a visitation from things you thought were fiction. Anything's possible, in The Unknown.",
        "helpful": [
            "6",
            "16"
        ]
    },
    {
        "review_id": "rw1134105",
        "reviewer": "mr_chatila",
        "movie": "Equilibrium (2002)",
        "rating": "10",
        "review_summary": "one of the best movies i ever saw...",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "this movie rocks :) its simply amazing and whats so wonderful about it is its simplicity and elegance...WELL DONE KURT WIMMER AND Christian BALE!!! Kurt wimmer as a director / writer is just great, so is Christian Bale ..amazing acting.. and i also liked the anti-hero taye diggs with his sly smiles and looks not a bad job at all :) the movie could have used a little bit more of realism though, but still as it is its really good and no matter how much i watch it i keep wanting to watch it again...bale's latest movie, batman returns, is not 1/2 as good as equilibrium... my most favorite scenes were not just the fight scenes or gun battles also how they are brainwashing the librarians , how the fight between the underground and the officials is going, but i just wish it wasn't soooooooo over-simplistic at times the storyline...and more depth was given to characterization or environment / setting...still overall its a wonderful movie - one of my favorites - go get it on DVD and watch it NOW u wont regret it :) Salam Aalaykum :)",
        "helpful": [
            "3",
            "6"
        ]
    },
    {
        "review_id": "rw1134106",
        "reviewer": "amjad_qureshi",
        "movie": "Emily (1976)",
        "rating": "1",
        "review_summary": "A total disappointment",
        "review_date": "23 July 2005",
        "spoiler_tag": 0,
        "review_detail": "I saw the movie when i was a teen ager and found it interesting only because Koo Stark, who at that time was in close contention with the Royal family, was exposed in it. I recently watched it again and was more disappointed. The movie is horribly directed and acted all through.It contains unbelievable scene sequence and the story is so unrealistic that it starts to bore after fifteen minutes. I wonder whether there is any connection of the plot with the writing of the legend Marquis de Sade. Everyone in the movie seem to be obsessed with one and only one feeling, and that is sex. The major sex scene at the end of the movie is also unerotic and boring. Don't watch this movie even if u r a fan of Koo Stark.",
        "helpful": [
            "0",
            "5"
        ]
    },
    {
        "review_id": "rw1134107",
        "reviewer": "jeannedarc",
        "movie": "Melancholian 3 huonetta (2004)",
        "rating": "3",
        "review_summary": "Why label the already once disgraced as the hopelessly pitiful?",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "As a volunteer working with homeless children and youth in St Petersburg I had high expectations of the film 3 Rooms of Melancholia, since the film was said to reflect emotional and mental states related to children rejected from dysfunctional families and in general to the homeless.However after seeing the film, I want to address that I am utterly shocked by the selfish and insensitive way the director Honkasalo dealt with the subjects of her documentary. Instead of giving the child interviewees a voice and a chance to talk about their lives before and during their military boarding school, this director serves us a series of narrated pathos-embedded statements depicting their awful backgrounds. As the homeless boys in the film are clearly working on restoring their crushed egos by trying to function progressively as group members in an institution accepted and respected by the society they live in, this immature, socio-pornographic primadonna comes with her pathological need to throw Gothic sensations out of her poetic dirt-bag. How little can a person understand the ashamed mind of the homeless and rejected and still be allowed to direct documentaries about this subject? The people awarding this documentary with human rights film prizes have little sense of the actual need the rejected and homeless have to be accepted as strong, progressive, dynamic characters who despite their socially disgraceful backgrounds can have their say in life without being publicly Kain-marked as the hopelessly pitiful.",
        "helpful": [
            "18",
            "68"
        ]
    },
    {
        "review_id": "rw1134108",
        "reviewer": "Obi_Will_Kenobi",
        "movie": "City Dragon (1995)",
        "rating": "10",
        "review_summary": "How can something this bad be this good?!?!",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "How can something this bad be this good!?!?!No budget + Dire acting + Comical fight scenes = City DragonThis film had me and my mates laughing our smelly little socks off for hours! at first i thought it was just the alcohol but on second viewing (in a more sober state) it was even funnier! The star of the show \"MC Kung fu\" is one of the all time great comic actors but the thing is... He's trying to be serious! He looks like a cross between Sly Stallone and a Michael Jackson's latest attempt at a face. and to top it off he has a hair cut that i'm sure he borrowed from a member of Duran-Duran.MC Kung Fu spends his days starting fights with strangers for reasons such as stepping on his ice cream and ... wait for it ... spilling his Pepsi! Chatting up girls via the medium of rap! with such poetic rhymes such as \"Tina, Tina, My African Queena\" and \"your so sweet even diabetes wouldn't stop me overdosing on you!\"He also enjoys wearing fingerless gloves, vests, and suit jackets with some of the biggest shoulder pads you'll ever see on a 32 inch screen!The film was clearly made on a budget of £3.50 but thats the best thing about it. the shaky sets, the \"hot new night clubs\" with only 3 extras in the background, the fact that they couldn't cast anyone with any acting talent!It is without a doubt the funniest thing I've ever seenSeriously I'm pleading with you RENT IT, BUY IT, BORROW IT, STEAL IT JUST PLEASE WATCH THIS FILM!!!!!!!!",
        "helpful": [
            "1",
            "3"
        ]
    },
    {
        "review_id": "rw1134109",
        "reviewer": "reo444",
        "movie": "They Made Me a Criminal (1939)",
        "rating": "10",
        "review_summary": "Great movie",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "I had heard of John Garfield, but, didn't know him. I loved this movie. I had never heard of it. I just picked it up randomly. John Garfield is a boxer in the movie. He had been in real life also so he knew his part. He was a fugitive throughout the movie. Someone else killed a man. He character was blamed. He is befriended by a family who has questions and is not quite sure what to make of him. All sorts of minor plots ensue. My favorite was the scary swimming scene in a water tower where the water was deep and one Dead End Kid couldn't swim, AND none of them could get out.John's character saves the day. The Dead End Kids were great as his friends and followers. One of them right to the very end. Ann Sheridan played the family's daughter and John's eventual love interest. She was believable, but not lovable in my opinion-the only weak link in the movie.",
        "helpful": [
            "2",
            "2"
        ]
    },
    {
        "review_id": "rw1134110",
        "reviewer": "clever-7",
        "movie": "Spice World: The Game (1998 Video Game)",
        "rating": null,
        "review_summary": "Once again for the fans...",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "Well I bought it cuz i was a fan of the 5 girls but the game disappointed me a bit.. OK, to be honest.. A LOT. But then again i got to see one \"hidden\" video of the girls that came with the game.There's not much to play on it, i finished it in 1 hour.. so i decided to look for the cheats of the game.. but the only thing worth to do was to make them giant on the screen. That's pretty much it.As with the movie, I think the people in production thought because they were the spice girls we were gonna buy anything that had them on it (which was actually true!!) but now i think they should've made an effort to come up with something better although i don't regret having bought their merchandise.",
        "helpful": [
            "2",
            "7"
        ]
    },
    {
        "review_id": "rw1134111",
        "reviewer": "loneoak404",
        "movie": "Drowning on Dry Land (1999)",
        "rating": "3",
        "review_summary": "I would not recommend this movie even to a die-hard Barbara Hershey fan.",
        "review_date": "24 July 2005",
        "spoiler_tag": 1,
        "review_detail": "I had heard about this movie, and wanted to see it. None of the local video rental stores had it. I looked on ebay, and sure enough, it was listed with a minimum bid of $3.50. I bid and got it. After watching it, $3.50 was a bit too much to pay. The only redeeming part of it was the last few minutes, man, Barbara Hershey still looks hot at 51! A movie has to pass two tests to get a good rating with me: (1.) A good, interesting plot, no fast forwarding to get past the boring parts. Has to keep my interest all the way through. (2.) A good ending, easy to understand, so I'm glad I watched it. Drowning on Dry Land failed both tests.Probably at least 20 percent of the movie was scenes that could easily be fast-forwarded through without missing a thing. Long scenes of driving along the highway, or someone simply walking along a road. The scene with the flat tire could be completely excised, no one would miss it.The ending? How did it end? I couldn't figure it out. I watched the last couple of minutes three times, still can't figure it out. Barbara Hershey walks out of the motel early one morning, Naveen Andrews is sitting watching the sunrise. Not a word is said, she sits beside him and they stare at the horizon. The picture fades, the credits start rolling up. What? What happened? I guess this movie was written so the viewer could make up his own ending.The movie is now in my trash can. No use to take up space in my inventory of videos.",
        "helpful": [
            "4",
            "4"
        ]
    },
    {
        "review_id": "rw1134112",
        "reviewer": "Chris-2541",
        "movie": "Unleashed (2005)",
        "rating": "10",
        "review_summary": "Best Jet Li Movie",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "First and foremost, this is merely my personal opinion, if your here to tell me how bad of a movie it is, save it. I don't care what you have to say, However bias it may sound, I just know a good movie when I see one.Not only was it the Best Jet li movie I have seen, I think it was one of my many favorite of many films that I have seen this year. With such great actors like Morgan Freeman and Bob Hoskins, and Jet li's acting has much improved as well. This movie combines some of my favorite genres from Kung-fu to drama, to action and perhaps even gore, this movie is rather violent. I think it was done so, as to convey the kind of violence that Danny inherited due to his evil master's example/ways. I think the story is perfectly believable, and it just keeps getting better, there isn't a dull moment from the jaw dropping fight scenes, some of jet li's best I think since Fist of Legend, and Once upon a time in china. To the growing relationships between danny and sam, to character and plot development. With a superb soundtrack, done by a great electronic band: Massive Attack. And beautiful cinematography. I have nothing more to say except it's the best movie I've seen all year, I suggest you go see it and enjoy it, as much as I did!",
        "helpful": [
            "21",
            "22"
        ]
    },
    {
        "review_id": "rw1134114",
        "reviewer": "lpbott",
        "movie": "Charlie and the Chocolate Factory (2005)",
        "rating": "9",
        "review_summary": "You smell like old people and Soap",
        "review_date": "24 July 2005",
        "spoiler_tag": 1,
        "review_detail": "Comparing this to the first movie is like comparing Grape Juice and Wine. Though similar completely different.You would have thought Charlie and the Chocolate Factory was written specifically for Tim Burton to make it. Not sugar coated and Happy and Cheerful as the first one. This delves into more of Why Willy Wonka is the way he is. Explains why Charlie takes his grandfather rather than anyone else. Over all an excellent movie good for kids better for Adults in the humor department. Very Visually stimulating. The problem with the first movie is it explained nothing. It was more of this is just the way it is, the only scene that didn't make since was the boat scene, that was the only real glimpse into Willy Wonka.Highly recommend if you want to know more of the actual story.",
        "helpful": [
            "0",
            "3"
        ]
    },
    {
        "review_id": "rw1134115",
        "reviewer": "et29b182ffdl489",
        "movie": "War of the Worlds (2005)",
        "rating": "9",
        "review_summary": "Impressive",
        "review_date": "24 July 2005",
        "spoiler_tag": 1,
        "review_detail": "I saw this movie multiple times. I was very impressed with the special effects and the tripods. Dakota Fanning really brought this movie to life. She did wonderfully as a young actress. She really made you beileve all her emotions were real. And I was very impressed.However, I did not give this movie a ten, because there are many details they overlooked. Apparently they didn't think that there were so many people out there that payed attention to detail. After the storm, I thought the power went out? Then soon after random citizens were filming things on video cameras, and shooting pictures. How on earth did there stuff start working so fast? When they were at the house where the airplane wreckage was, you're telling me that the storm was strong enough to tear the roof off of an airplane, but the car didn't get a dent on it? When they arrive in Boston, why are they all so clean? There was many tripods just minutes before in the movie, so why was everything there perfectly in order? Boston is considered a main city in our country, there should have been more damage. They also really screwed up at the very end. What the heck are they talking about? How did the smallest particles destroy them? It didn't really clearly say what took the tripods down.",
        "helpful": [
            "1",
            "4"
        ]
    },
    {
        "review_id": "rw1134116",
        "reviewer": "fwmurnau",
        "movie": "Three Sisters (1970)",
        "rating": "8",
        "review_summary": "Superb cast, production; lousy sound",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "A fine, sensitive filming of a fine stage production of Chekhov's masterpiece THE THREE SISTERS. A few of the actors are a bit too broad and stagey (especially the oldest sister, the schoolteacher), reflecting inexperience acting for the camera, but that's a minor flaw.What's up with the sound? I rented the DVD and the sound track is terrible for a film from this period. It's hard to make out some of the dialogue, especially when a character turns away from the camera. I hate having to strain to hear dialogue, especially dialogue by Chekhov! It seems to be a recording problem. The film was shot on what seem to be massive stage sets. This family's provincial home looks roughly the size of the Winter Palace. I'm guessing the cavernous sets swallowed up and muffled the dialogue, resulting in the poor sound quality.Aside from the deficiencies of the sound (and there's no excuse for such a problem in a production from 1970 -- fire that sound engineer!) it's a great production of a gently funny and bittersweet classic play.",
        "helpful": [
            "13",
            "15"
        ]
    },
    {
        "review_id": "rw1134117",
        "reviewer": "infoscamp",
        "movie": "Almost Dead (1994)",
        "rating": "1",
        "review_summary": "Completely ridiculous!!!",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "Completely ridiculous!!! Shannon Doherty is supposedly being stalked by the corpse of her dead mother, but as if that's not strange enough, the odd part is she doesn't seem remotely surprised or upset that a dead person is after her. At one point, she is actually buried alive on top of her dead mother's cadaver, and she behaves as if this event is barely out of the ordinary. The most annoying part is the final few minutes. The film has tried to be a true horror story, then tries to give a reasonable non-supernatural explanation for what went on, but then ends with a scene that is supposed to be both supernatural and comic - completely alien to the rest of the film! Ugh!",
        "helpful": [
            "6",
            "12"
        ]
    },
    {
        "review_id": "rw1134118",
        "reviewer": "jedi_master-2",
        "movie": "Street Fighter (1994)",
        "rating": "10",
        "review_summary": "Awesome movie, puts the game to shame.",
        "review_date": "24 July 2005",
        "spoiler_tag": 1,
        "review_detail": "MAY CONTAIN SPOILERS READ AT YOUR OWN RISK OK I've played the game on the Sega like 500 times, and i was so happy when this movie came out. of course the was years ago when i was a kid, but i still remember the storyline clear as day. it doesn't really take after the game, but has plenty of action scenes, has all the characters from the game, and a lot of the moves from the game. the game really didn't have a story line so the movie really makes it have one. Seeing this movie really puts action in the action movie category. Its great to rent as a weekend movie, and is a must see before u hit that heavenly place in the sky. PUTS THE GAME TO SHAME!",
        "helpful": [
            "14",
            "29"
        ]
    },
    {
        "review_id": "rw1134119",
        "reviewer": "lee_eisenberg",
        "movie": "Hold That Ghost (1941)",
        "rating": "5",
        "review_summary": "Abbott and Costello needed the Ghostbusters",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "I prefer it when comedies don't have people occasionally break out into song (leave that to Gene Kelly, will ya!). But once the unnecessary songs in \"Hold That Ghost\" are over, the movie gets going. Bud and Lou play gas station attendants Chuck Murray and Ferdinand \"Ferdie\" Jones, who inherit a murdered gangster's fortune. The fortune is located in what appears to be a haunted house. Since Ferdie gets freaked out by every little thing, you can probably guess what sorts of things happen in the house.The more Lou irks everyone, the more you want him to do so. I really liked the room switching scene. Maybe \"Hold That Ghost\" was old-school, but it was good for a few laughs.",
        "helpful": [
            "1",
            "4"
        ]
    },
    {
        "review_id": "rw1134120",
        "reviewer": "akumar82",
        "movie": "Shabd (2005)",
        "rating": "9",
        "review_summary": "Did no one get this movie? Here's my analysis of Shaukat's story and motives...",
        "review_date": "24 July 2005",
        "spoiler_tag": 1,
        "review_detail": "Sanjay Dutt plays Shaukat, a writer and domineering control freak who tries to force his wife Antara (Aishwarya Rai) into an affair with her colleague Yash (Zayed Khan) in order to survive his writer's block and write a critically acclaimed, bestselling novel. Here's what I got from the movie. (1) - Shaukat plays a control freak to the hilt, who feels like his ability to artistically create something carries over to reality. He fools himself into truly believing in the power of his work, that he's so talented he somehow has the ability to not only control his wife's actions, but also her innermost thoughts and feelings. When Shaukat realizes that he can't control Antara (I can't believe I still remember these names, by the way - I haven't seen the film since opening night back in Feb) he goes insane and loses his own grip on reality. (2) - I don't know why anyone would be interested in this cautionary tale for artists- I think the point of the movie for artists is to realize that you can't take your work so seriously as to have it control you to such an extent as Shaukat did. Realistic, natural art can't be manufactured, it flows from within. He can't forcefully create a love affair between Antara and Yash because this isn't in his control. He's so wrapped up in making a \"realistic\" story after such extreme critical rejection that he tries to force a situation that naturally can't occur. When he realizes that he's ultimately powerless, he loses his mind. Lets look at Shaukat's motivations besides his need for critical success and the desire for the power to make situations happen - his desire to \"play god\" so to speak. Abstract notions aside, I think Shaukat was also bored with his marriage and his life. He marries his student who appears to be a mysterious and beautiful young woman. He sees her as this enigma, a woman who he thinks will always be able to keep him on his toes, guessing. Antara doesn't turn out this way. She turns out to be a simple girl who eventually becomes a professor and falls into a life of predictability in marriage and work. Shaukat's notion of women is anything but simple - his character Tamanna is supposedly based on how he views his wife- mysterious, sexy, beautiful, and ultimately conniving and manipulative. But this is NOT the woman simple Antara really is. He wants to make her into something she's not because he's bored with the real Antara, so he sets out to spice up his marriage through his work by throwing this character based on what he WANTS his wife to be into an affair with Yash. Antara really doesn't enter into an affair with Yash, only managing to stay friends with him and turning him away at the end. So Shaukat fails to recreate his wife's personality and make his wife and marriage more interesting - another ironic reality he can't seem to face. She tells Shaukat in the beginning, while he's having writers block, \"Don't look for your story in me, I'm just a simple woman with simple dreams.\" He doesn't want the simple woman, he wants the temptress he imagines in his writings. Unfortunately for Antara, he prefers Tamanna, evidenced by the her sexy dance he imagines at the restaurant while they're dancing to \"Sholon Si.\" He sees the temptress Tamanna dancing seductively to the music surrounded by men rather than his boring, docile wife Antara, who only manages to submissively slow-dance with him. Ultimately, Shaukat can't face the fact that he's a loser, professionally as a writer and personally as a bored husband. He wants a certain lifestyle of the flashy, sensual, and mysterious wife and a hotshot career as a writer. He ends up a reclusive failed writer living in seclusion and falling into a life of marital boredom. Antara and Shaukat's dance at the end in the asylum is his submission to these facts and willingness to try to accept the ordinary life he has rather than the exciting life he covets.This is a beautiful story of a man who wants too much from life and ends up not getting any of it. It's rather cruel in a way, this writer is given an initial taste of success and a life of fame, only to have it taken away.The performances, barring Zayed Khan who was awkwardly terrible were excellent. Aishwarya plays two different characters - Antara, the vulnerable woman and Tamanna, the bewitching, mysterious, and conniving fantasy Shaukat wants Antara to be. She does both characters remarkably well and with a lot of subtle facial nuances. Her facial expressiveness brings a level of depth to both characters. Sanjay Dutt is brilliant as the alpha-male writer who refuses to accept mediocrity in life and in work. His presence is commanding. No one could have played Shaukat the way he did. Maybe if Bachchan was younger, he'd have the style and panache to do it, but no one else in my opinion. Dutt has that movie-star arrogance and charisma to make the role believable. And he has some smoldering chemistry with Aishwarya Rai. I've never seen Aish look so alluring with another male costar - she's like a block of ice with everyone else. But it looks like she's got a thing for Sanjay with the way they interact on screen. What a great looking couple. The film is beautifully shot, like a wonderfully dark painting. Everything looks classy and gorgeous, especially the songs. The movie may have been confusing but if you take the time to really explore these characters and the untold motivations behind these characters and their actions. It's all there, you just have to think about it and look hard enough. Art is subjective, even if you don't agree with my interpretation, you'll still take something of your own away from the movie. Brilliant, abstract stuff, loved it! 9/10",
        "helpful": [
            "9",
            "11"
        ]
    },
    {
        "review_id": "rw1134121",
        "reviewer": "sol-",
        "movie": "The Upside of Anger (2005)",
        "rating": "4",
        "review_summary": "My brief review of the film",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "Aggression is something that many of us have not only felt, but have seen change other people. It is a human theme and it is therefore easy to connect to when it is shown screen. For this reason, a number of viewers will perhaps take well to this film. However, those same people would take well to an average run-of-the-mill telepic that deals with the same issues, as this film is no better than such productions. Although the ideas and issues are easy to relate to, the same stuff has been explored in many other films, many times before, and the fashion that they are presented in here is very hackneyed. The characters are never better than ordinary, and they are even a tad annoying to have on screen. There is also a severe under-development of Joan Allen's character, as we see her angry, but we do not see her before she changes, and therefore there is no contrast: no visible change. Allen has received a lot of praise for being so angry and stressed, but she is never not - so she is just playing one emotional type - and I cannot call that a good performance myself. The rest of the cast deliver reasonably well, but there are no great performances. I really cannot call this a very good film, but if it could have brought something new in, then I feel the film could have risen above the mark.",
        "helpful": [
            "1",
            "2"
        ]
    },
    {
        "review_id": "rw1134122",
        "reviewer": "silvercannonca",
        "movie": "Wedding Crashers (2005)",
        "rating": "9",
        "review_summary": "Much funnier than anticipated",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "I went to this movie as a compromise with my brother - thinking, sigh, young guy movie. It was great! I laughed out loud and didn't stop. Rates up there with Something About Mary. Nothing was off limits to poke fun at. The guys who forgot to grow up, the guys who eventually grew up, but cut if close, craziness of some women, the craziness and full of shitness of some men, politics and the politically connected families, the super materialistic people that marry but don't really care about each other, the old, and pretty much everything and everyone. ...really, it isn't worth all this writing, but to give feedback, ten lines is required.",
        "helpful": [
            "0",
            "5"
        ]
    },
    {
        "review_id": "rw1134123",
        "reviewer": "lee_eisenberg",
        "movie": "The Raven (1963)",
        "rating": "10",
        "review_summary": "Quoth Vincent Price: Nevermore!",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "My rating of 10/10 applies to the fact that it's so neat to see Boris Karloff and Vincent Price in a movie together, and in one with Peter Lorre and Jack Nicholson at that! Price and Lorre play magicians Erasmus Craven and Adolphus Bedlo, who battle against the nefarious Dr. Scarabus (Boris Karloff). The climax has Craven and Scarabus one-upping each other.It's hard to believe that Jack Nicholson - as Bedlo's son - was once young, but it looks like he was. And he was under-acting in relation to his usual roles. It must have been fun for him to get to co-star with Vincent Price.Vincent Price...probably the only horror star in history who made a guest appearance on \"The Brady Bunch\".",
        "helpful": [
            "0",
            "4"
        ]
    },
    {
        "review_id": "rw1134125",
        "reviewer": "hrhqueene",
        "movie": "Bluegrass Journey (2004)",
        "rating": "8",
        "review_summary": "Not quite perfect",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "\"Bluegrass Journey\" highlights some fantastic moments in American acoustic music, and should appeal to aficionados of both traditional bluegrass (Del McCoury Band, Bob Paisley and Southern Grass) and newgrass (Nickel Creek, The Texas Trio) with a bone thrown to Celtic music as well (Tim O'Brien and The Crossing). The camera work is at times stunning, putting us not just right on stage at the Grey Fox Festival, but intimately close to instruments played expertly and with great affection. The offerings by Dobro virtuoso Jerry Douglas are by themselves worth the price of the DVD.The directors have inexplicably included a grating scene of a New Age wedding which not only adds absolutely nothing to the film, but detracts from it. One can only speculate as to why they deemed this worthy of our attention, but omitted any portrayal of the hymns and Sunday morning Gospel sings which are integral to the genre, and which grace almost every bluegrass festival I've ever heard of.The unfortunate wedding scene notwithstanding, \"Bluegrass Journey\" is a worthwhile tribute to a truly American art form.",
        "helpful": [
            "1",
            "2"
        ]
    },
    {
        "review_id": "rw1134126",
        "reviewer": "jb-schnitzler",
        "movie": "Steve Vai: Live at the Astoria London (2003 Video)",
        "rating": "7",
        "review_summary": "Steve Vai=Guitar God",
        "review_date": "24 July 2005",
        "spoiler_tag": 0,
        "review_detail": "What can I say? Steve Vai is a god. I bought this DVD after seeing Steve live in April in Toronto. Despite being mostly an instrumentalist, Steve Vai has a compelling stage presence, and he is in excellent form on this DVD. Not only is he the best, the rest of his band are very skilled musicians and some of the best. Billy Sheehan is simply put, an incredible bassist. Tony Macalpine is a shredder capable of playing some of Steve's hardest lines, but that's not just it, his keyboard skill may even surpass his guitar playing. Dave Weiner is another good guitar player who plays most of the rhythm. And finally, Virgil Donati provides a strong back bone to the whole thing, being a very intense drummer (he also has a drum solo, which starts a little slow, but when it builds up it is amazing). The set is great and contains most of his best songs. The highlights (in my opinion) are: Erotic Nightmares (one of my personal faves), Blue Powder, Little Wing, The Crying Machine, The Animal, Jibboom and The Attitude Song. A Vai tradition, Steve brings up Eric Sardinas (his opening man, also a very good guitar player) for the Attitude Song and extended soloing ensues from all players (at this moment, 4 guitarists and a bassist!). It is also noteworthy that Steve reproduces all effects heard in songs (remember the weird interlude in Blue Powder?). Along with his own songs, two Sheehan songs, two Hendrix covers, a classical piece and Dave Weiner's solo are included. Also, listen to the beginning of Fire where Steve talks about Britney Spears. This is also a trend with him, we got to hear about Britney at the Toronto concert, Heh. If you have any interest in guitar, BUY THIS. Hell, buy it even if you don't.",
        "helpful": [
            "3",
            "3"
        ]
    },
    {
        "review_id": "rw1134128",
        "reviewer": "Will-McClay",
        "movie": "Podzemelye vedm (1990)",
        "rating": "9",
        "review_summary": "Trash horror fun with heavy Biblical symbolism!",
        "review_date": "23 July 2005",
        "spoiler_tag": 0,
        "review_detail": "I was privileged enough to pick up a copy of this seminal piece of Russian horror (horrorpiece, to employ the official term)at Mike Knight's Open-All-Night VHS Dungeon on W 5th Street, LA in the early 90s. For anyone familiar with the area at this time, Mike's store was a great place for the distinguished VHS \"aficionado\" to relish in the more under-appreciated World rarities. Sadly, he who lives by the sword dies by the sword; I last heard Mike's Dungeon was closed down for video piracy by none other than LA's infamous video piracy vigilante, The Pirate JB. On to the film, and what a film! Marina Levtoza (who later went on to star in what was a bigger box office success, yet inferior critical success, 'President i yego zhenshchina' aka 'The President and his Women') delivers a strikingly convincing performance as the mentally unhinged love interest Belogurochka. It is delightful to see a horror film of this calibre (trash horror) trying its hand at some old fashioned Biblical symbolism, as Marina is enticed by the dark side, or Satan's path, as represented by the witches. This is pure Genesis parody, and the tremendous clout of the chromatic imagery is rival, if not commensurate, to that of Polanski's 'Rosemary's Baby' (1968). The witches, of course, inhabit a cave, symbolic of that small, hidden alcove in all our hearts where Satan lurks, \"whispering\" to us with his empty promises. NOTE: The witches communicate with each other by whispering! Class!",
        "helpful": [
            "6",
            "16"
        ]
    },
    {
        "review_id": "rw1134130",
        "reviewer": "kameamea",
        "movie": "Yoru no tsuzumi (1958)",
        "rating": "9",
        "review_summary": "Remarkable Japanese romantic tragedy",
        "review_date": "23 July 2005",
        "spoiler_tag": 0,
        "review_detail": "A Japanese classic from way back, of special interest to lovers of black and white cinematography. With elegant and dreamlike images, this unpretentious film evokes Japan's forgotten feudal world from the perspective of one wealthy household. As a simple story of an illicit affair (devoid of FX, commercial tie-ins, or anime) cynics may find it a bit melodramatic. But when I saw it as a teenager (in the 70s) it was heady stuff.Like many older Japanese films, it examines the tug-of-war between rigid social rules and personal desire. Having broken an unyielding taboo, the central characters all pay a terrible price as the romance unfolds. Masayuki Mori is incandescent here, as intelligent and seductive as any male film star you're likely to see.",
        "helpful": [
            "3",
            "3"
        ]
    },
    {
        "review_id": "rw1134131",
        "reviewer": "imdb-8315",
        "movie": "Angli: The Movie (2005)",
        "rating": "1",
        "review_summary": "A pitiful excuse to earn some money",
        "review_date": "23 July 2005",
        "spoiler_tag": 0,
        "review_detail": "This must definitely rate as the worst movie I have ever seen. The reason I'm saying this is that the producers didn't get anything right - the colours severely lacked saturation and the contrast was high (also some explosions were in 256 colour, looking as fake as it gets), the acting was awful (the actors lacked passion \"sparawli l'ohti!/they shot my sister!\" as if nothing happened), the sound was horrible (at several points the sound is not even synchronised with the video, and it has split second sound losses every now and then), the story was broken and the adverts were in-your-face and all over the place.This movie is supposed to be a thriller, but really it ends up becoming a comedy because it is so awful. It is just a pitiful excuse for some revenue coming from people eagerly awaiting Malta's debut movie.",
        "helpful": [
            "10",
            "16"
        ]
    },
    {
        "review_id": "rw1134132",
        "reviewer": "murdoc69",
        "movie": "Rom-Mánia (2004)",
        "rating": "1",
        "review_summary": "Boring and awful",
        "review_date": "23 July 2005",
        "spoiler_tag": 0,
        "review_detail": "This is the worst Hungarian film I've ever seen. It should be funny, but it was boring. It should show how the Romanian people suffered under the Ceausescu regime, but with irony and with jokes. Some jokes that they used were very old Hungarian jokes, and the jokes of the creators were horrible! And the narration was awful too! It has no real plot. Only unfunny sequences follows one another. So this film sucks. And you know this from the beginning. Because the first scene which should be funny is when Ceausescu is sitting on the toilet and speaks with his wife. So here is a good advice: avoid this film, and don't spend money on it. Because the worst thing is that I payed for this movie! Save your money, and save your life!",
        "helpful": [
            "3",
            "3"
        ]
    }
]